zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
/**
  ******************************************************************************
  * @file    stm32h5xx_hal_ccb.c
  * @author  MCD Application Team
  * @brief   CCB HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Inter Integrated Circuit (CCB) peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral State and Errors functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
    [..]
    The CCB HAL driver can be used as follows:

    (#) Declare a CCB_HandleTypeDef handle structure, for example: CCB_HandleTypeDef  hccb;

    (#) Initialize the CCB low level resources by implementing the HAL_CCB_MspInit() API:
        (##) Enable the CCB interface clock

    (#) Initialize the CCB registers by calling the HAL_CCB_Init() API which trig
        HAL_CCB_MspInit().

    (#) Fill entirely the structures corresponding to your operation:
        For instance: CCB_ECDSACurveParamTypeDef and CCB_ECDSAKeyBlobTypeDef
        for HAL_CCB_ECDSA_WrapPrivateKey().

    (#) Execute the operation and check the returned value.

    (#) Call the function HAL_CCB_DeInit() to restore the default configuration which trig
        HAL_CCB_MspDeInit().

    *** High level operation ***
    =================================
    [..]
      (+) Input structure requires buffers as uint8_t array.

      (+) Output structure requires buffers as uint8_t array.

      (+) Proteted ECDSA Sign
      (++) HAL_CCB_ECDSA_WrapPrivateKey() for protected ECDSA blob creation when using user key.
      (++) HAL_CCB_ECDSA_GenerateWrapPrivateKey() for protected ECDSA blob creation when using internal key.
      (++) HAL_CCB_ECDSA_Sign() for protected ECDSA Signing message usage.
      (++) HAL_CCB_ECDSA_ComputePublicKey() for protected ECDSA computing public key usage.

      (+) Proteted ECC Scalar Multiplication
      (++) HAL_CCB_ECC_WrapPrivateKey() for protected ECC blob creation when using user key.
      (++) HAL_CCB_ECC_GenerateWrapPrivateKey() for protected ECC blob creation when using internal key.
      (++) HAL_CCB_ECC_ComputeScalarMul() for protected ECC scalar multiplication usage.

      (+) Proteted RSA Modular Exponentiation
      (++) HAL_CCB_RSA_WrapPrivateKey() for protected RSA blob creation when using user key.
      (++) HAL_CCB_RSA_ComputeModularExp() for protected RSA computing modular exponetiation usage.

  @endverbatim
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx_hal.h"

/** @addtogroup STM32H5xx_HAL_Driver
  * @{
  */
#if defined(CCB) && defined(HAL_CCB_MODULE_ENABLED)

/** @defgroup CCB CCB
  * @brief CCB HAL module driver
  * @{
  */

/* Private define ------------------------------------------------------------*/
/** @addtogroup CCB_Private_Defines
  * @{
  */

/** @defgroup CCB_TIMEOUT_DEFAULT_VALUE CCB timout Default Value
  * @{
  */
#ifndef HAL_CCB_TIMEOUT_DEFAULT_VALUE
#define HAL_CCB_TIMEOUT_DEFAULT_VALUE      0xFFFFU         /* CCB Timeout.*/
#endif /*HAL_CCB_TIMEOUT_DEFAULT_VALUE */
#if (defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX))
#define CCB_RNG_TIMEOUT_VALUE              0x00000002U
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
/**
  * @}
  */

/** @defgroup CCB_Operations CCB Operations
  * @{
  */
#define CCB_ECDSA_SIGN_CPU_BLOB_CREATION     (0x000000C0U)  /*!< ECDSA signature blob creation with priv key from the CPU */
#define CCB_ECDSA_SIGN_RNG_BLOB_CREATION     (0x000000C2U)  /*!< ECDSA signature blob creation with priv key from the RNG */
#define CCB_ECDSA_SIGN_BLOB_USE              (0x000000C3U)  /*!< ECDSA signature blob use for ECDSA signature */
#define CCB_ECC_SCALAR_MUL_CPU_BLOB_CREATION (0x00000080U)  /*!< ECC scalar multiplication blob creation with priv key from the CPU- */
#define CCB_ECC_SCALAR_MUL_RNG_BLOB_CREATION (0x00000082U)  /*!< ECC scalar multiplication blob creation with priv key from the RNG */
#define CCB_ECC_SCALAR_MUL_BLOB_USE          (0x00000081U)  /*!< ECC Scalar multiplication blob use, or ECDSA signature blob use for public key computation */
#define CCB_MODULAR_EXP_CPU_BLOB_CREATION    (0x00000044U)  /*!< Modular exponentiation blob creation with priv key from the CPU */
#define CCB_MODULAR_EXP_BLOB_USE             (0x00000045U)  /*!< Modular exponentiation blob use */
#define CCB_PKA_ECDSA_VERIF_OK               (0x0000D60DU)  /*!< PKA ECDSA Signature verification success */

/**
  * @}
  */

/** @defgroup CCB_PKA_Mode CCB PKA mode
  * @{
  */
#define CCB_PKA_MODE_MODULAR_EXP_PROTECT     (0x00000003UL)  /*!< PKA Modular exponentiation */
#define CCB_PKA_ECC_MUL_MODE                 (0x00000020UL)  /*!< PKA ECC scalar multiplication */
#define CCB_PKA_ECDSA_SIGNATURE_MODE         (0x00000024UL)  /*!< PKA ECDSA signature */
#define CCB_PKA_MODE_ECDSA_VERIFICATION      (0x00000026UL)  /*!< PKA ECDSA verification */
#define CCB_PKA_ERROR_OPERATION_NONE         (0x0000D60DUL)  /*!< No PKA Hardware operation error */
#define CCB_PKA_RAM_SIZE                     (0x00000536UL)  /*!< CCB PKA Ram Size */

/**
  * @}
  */

/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup CCB_Private_Constants CCB Private Constants
  * @{
  */
#define CCB_FAKE_VALUE               0X0001UL /*!< Fake value used for SAES_IVRs                             */
#define CCB_MAGIC_VALUE              0X0CCBUL /*!< Magic number used when chaining key from SAES to PKA RAM  */
#define CCB_IV0_VALUE                0X0002UL /*!< SAES_IVR0 that must be equal to 0x2                       */
#define CCB_BLOCK_SIZE               0X0004UL /*!< Block size is 128 Bits (4*32 bits)                        */
#define CCB_SIZE_SKEY_INWORD         0X0008UL /*!< Symmetric key size is always 256 (8*32 bits)              */
#define CCB_COMPUTE_PUBLIC_KEY       0x02U    /*!< CCB compute public key                                    */
#define CCB_VERIF_OPERATION_ENABLED  0x01U    /*!< CCB verification enabled                                  */
#define CCB_VERIF_OPERATION_DISABLED 0U       /*!< CCB verification disabled                                 */

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/** @addtogroup CCB_Private_Macros
  * @{
  */
#define RAM_PARAM_END(TAB,INDEX)                do{                                   \
                                                                    TAB[INDEX] = 0UL;       \
                                                                    TAB[INDEX + 1U] = 0UL;  \
                                                                  } while(0)

