zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
#define HAL_CCB_GET_FLAG(__HANDLE__, __FLAG__)                  (((((__HANDLE__)->Instance->SR)\
                                                                   & (__FLAG__)) == (__FLAG__)) ? SET : RESET)

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define HAL_CCB_GET_SAES_INSTANCE(__HANDLE__)                   (((__HANDLE__)->Instance == CCB_S)?\
                                                                 SAES_S : SAES_NS)
#else
#define HAL_CCB_GET_SAES_INSTANCE(__HANDLE__)                    SAES_NS
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define HAL_CCB_GET_PKA_INSTANCE(__HANDLE__)                   (((__HANDLE__)->Instance == CCB_S)?\
                                                                PKA_S : PKA_NS)
#else
#define HAL_CCB_GET_PKA_INSTANCE(__HANDLE__)                    PKA_NS
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#define HAL_CCB_GET_RNG_INSTANCE(__HANDLE__)                   (((__HANDLE__)->Instance == CCB_S)?\
                                                                RNG_S : RNG_NS)
#else
#define HAL_CCB_GET_RNG_INSTANCE(__HANDLE__)                    RNG_NS
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#define HAL_CCB_GET_SAES_FLAG(__HANDLE__,__FLAG__)           (((__FLAG__)>1U)  ?                    \
                                                              (((HAL_CCB_GET_SAES_INSTANCE(__HANDLE__)->SR\
                                                                 & (__FLAG__)) == (__FLAG__)) ? SET : RESET) :\
                                                              (((HAL_CCB_GET_SAES_INSTANCE(__HANDLE__)->ISR\
                                                                 & (__FLAG__)) == (__FLAG__)) ? SET : RESET) )

#define HAL_CCB_GET_PKA_FLAG(__HANDLE__,__FLAG__)              ((((HAL_CCB_GET_PKA_INSTANCE(__HANDLE__)->SR)\
                                                                  & (__FLAG__)) == (__FLAG__)) ? SET : RESET)

#define HAL_CCB_CLEAR_PKA_FLAG(__HANDLE__,__FLAG__)  WRITE_REG(HAL_CCB_GET_PKA_INSTANCE(__HANDLE__)->CLRFR, (__FLAG__))

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/

/* Polling Private function */
static HAL_StatusTypeDef CCB_WaitOperStep(CCB_HandleTypeDef *hccb, uint32_t step, uint32_t Timeout);
static HAL_StatusTypeDef CCB_WaitFLAG(CCB_HandleTypeDef *hccb, uint32_t flag, uint32_t Timeout);
static HAL_StatusTypeDef Protect_PKA_WaitFLAG(CCB_HandleTypeDef *hccb, uint32_t flag, uint32_t Timeout);
static HAL_StatusTypeDef Unprotect_PKA_WaitFLAG(CCB_HandleTypeDef *hccb, uint32_t flag, uint32_t Timeout);
static HAL_StatusTypeDef CCB_RNG_Wait_SET_FLAG(CCB_HandleTypeDef *hccb, uint32_t flag, uint32_t Timeout);
static HAL_StatusTypeDef Protect_SAES_WaitFLAG(CCB_HandleTypeDef *hccb, uint32_t flag, FlagStatus Status,
                                               uint32_t Timeout);

/* Set parameters Private function */
static HAL_StatusTypeDef CCB_ECDSASign_SetPram(CCB_HandleTypeDef *hccb, CCB_ECDSACurveParamTypeDef *in);
static HAL_StatusTypeDef CCB_ECCMul_SetPram(CCB_HandleTypeDef *hccb, CCB_ECCMulCurveParamTypeDef *in);
static HAL_StatusTypeDef CCB_RSAModExp_SetPram(CCB_HandleTypeDef *hccb, CCB_RSAParamTypeDef *in);
static HAL_StatusTypeDef CCB_SetPram(CCB_HandleTypeDef *hccb, uint32_t modulusSizeByte, uint32_t dst_address,
                                     const uint8_t *src);

/* Initialization Private function */
static HAL_StatusTypeDef Protect_PKA_Init(CCB_HandleTypeDef *hccb, uint32_t Operation);
static HAL_StatusTypeDef Unprotected_PKA_Init(CCB_HandleTypeDef *hccb);
static HAL_StatusTypeDef CCB_RNG_Init(CCB_HandleTypeDef *hccb);

/* Wrapping Private function */
static HAL_StatusTypeDef WrappingKeyConfiguration(CCB_HandleTypeDef *hccb, uint32_t Operation,
                                                  CCB_WrappingKeyTypeDef *pWrappingKey);
static HAL_StatusTypeDef Protect_SAES_UnwrapKey(CCB_HandleTypeDef *hccb, const CCB_WrappingKeyTypeDef *pWrappingKey,
                                                uint32_t Timeout);

/* Data managementPrivate function */
static uint32_t GetOptBitSize_u8(uint32_t byteNumber, uint8_t msb);
static void CCB_Memcpy_u8_to_u32(__IO uint32_t dst[], const uint8_t src[], size_t size);
static void CCB_Memcpy_u32_to_u8(uint8_t dst[], __IO const uint32_t src[], size_t n);
static void CCB_Memcpy_u32_to_u32(__IO uint32_t dst[], __IO const uint32_t src[], size_t n);
static void CCB_Memcpy_u8_to_u64(__IO uint32_t dst[], const uint8_t src[]);
static void CCB_Memcpy_Not_Align(__IO uint32_t dst[], const uint8_t src[], size_t size);
static uint32_t CCB_get_cipherkey_size(CCB_ECDSACurveParamTypeDef *pCurveParam);

/* Blob processing Private function */
static HAL_StatusTypeDef CCB_WrapSymmetricKey(CCB_HandleTypeDef *hccb, const uint32_t *pClearAESKey, uint32_t operation,
                                              CCB_WrappingKeyTypeDef *pWrappingKey);
static HAL_StatusTypeDef CCB_BlobCreation_InitialPhase(CCB_HandleTypeDef *hccb, uint32_t *IV);
static HAL_StatusTypeDef CCB_BlobUse_InitialPhase(CCB_HandleTypeDef *hccb, const uint32_t *pIV, uint32_t *pTag);
static HAL_StatusTypeDef CCB_BlobCreation_FinalPhase(CCB_HandleTypeDef *hccb, uint32_t Operation, uint32_t *pTag,
                                                     uint32_t sizeparam);
static HAL_StatusTypeDef CCB_BlobUse_FinalPhase(CCB_HandleTypeDef *hccb, uint32_t Operation, uint32_t sizeparam);
static HAL_StatusTypeDef CCB_ECDSA_SignBlobCreation(CCB_HandleTypeDef *hccb, CCB_ECDSACurveParamTypeDef *pCurveParam,
                                                    const uint8_t *pClearPrivateKey,
                                                    CCB_WrappingKeyTypeDef *pWrappingKey, uint32_t *pIV,
                                                    uint32_t *pTag, uint32_t *pWarappedKey, uint8_t *pHash,
                                                    CCB_ECDSASignTypeDef *pSignature, uint8_t CCB_Operation);
static HAL_StatusTypeDef CCB_ECC_ScalarMulBlobCreation(CCB_HandleTypeDef *hccb,
                                                       CCB_ECCMulCurveParamTypeDef *pCurveParam,
                                                       const uint8_t *pClearPrivateKey,
                                                       CCB_WrappingKeyTypeDef *pWrappingKey,
                                                       uint32_t *pIV, uint32_t *pTag, uint32_t *pWarappedKey,
                                                       uint32_t PublicKey[2U][20U], uint8_t CCB_Operation);
static HAL_StatusTypeDef CCB_ECC_ComputeScalarMul(CCB_HandleTypeDef *hccb, CCB_ECCMulCurveParamTypeDef *pCurveParam,
                                                  CCB_WrappingKeyTypeDef *pWrappingKey,
                                                  uint32_t *pIV, uint32_t *pTag, uint32_t *pWarappedKey,
                                                  CCB_ECCMulPointTypeDef *pInputPoint,
                                                  CCB_ECCMulPointTypeDef *pOutputPoint,
                                                  const uint32_t *pPublicKey,
                                                  uint8_t VerifOperation);
static HAL_StatusTypeDef CCB_RSA_ExpBlobCreation(CCB_HandleTypeDef *hccb, CCB_RSAParamTypeDef *pParam,
                                                 const CCB_RSAClearKeyTypeDef *pRSAClearPrivateKey,
                                                 CCB_WrappingKeyTypeDef *pWrappingKey, uint32_t *pIV,
                                                 uint32_t *pTag, uint32_t *pWrappedExp, uint32_t *pWrappedPhi,
                                                 uint8_t *pOperand, uint32_t *pReferenceModularExp);
static HAL_StatusTypeDef CCB_RSA_ComputeModularExp(CCB_HandleTypeDef *hccb, CCB_RSAParamTypeDef *pParam,
                                                   CCB_WrappingKeyTypeDef *pWrappingKey, uint32_t *pIV,
                                                   uint32_t *pTag, uint32_t *pWrappedExp, uint32_t *pWrappedPhi,
                                                   const uint8_t *pOperand, uint8_t *pModularExp,
                                                   const uint32_t *pReferenceModularExp, uint8_t VerifOperation);
#if  defined(SW_SANITY_CHECK_SUPPORT)
static HAL_StatusTypeDef PKA_ECDSASign(CCB_HandleTypeDef *hccb, CCB_ECDSACurveParamTypeDef *pCurveParam,
                                       const uint8_t *pClearPrivateKey, uint8_t *pInteger, uint8_t *pHash,
                                       CCB_ECDSASignTypeDef *pSignature);

static HAL_StatusTypeDef PKA_ECC_ComputeScalarMul(CCB_HandleTypeDef *hccb, CCB_ECCMulCurveParamTypeDef *pCurveParam,
                                                  const uint8_t *pClearPrivateKey, uint32_t PublicKey[2][20]);
static HAL_StatusTypeDef PKA_RSA_ComputeModularExp(CCB_HandleTypeDef *hccb, CCB_RSAParamTypeDef *pParam,
                                                   const CCB_RSAClearKeyTypeDef *pRSAClearPrivateKey,
                                                   uint8_t *pOp1, uint32_t *pReferenceModularExp);
static HAL_StatusTypeDef PKA_RAM_Erase(CCB_HandleTypeDef *hccb);
#endif /* GENERATOR_SW_SANITY_CHECK_AVAILABLE_ALL_DEVICES */
static HAL_StatusTypeDef PKA_ECDSAVerif(CCB_HandleTypeDef *hccb, CCB_ECDSACurveParamTypeDef *pCurveParam,
                                        CCB_ECCMulPointTypeDef *pPublicKeyOut, const uint8_t *pHash,
                                        CCB_ECDSASignTypeDef *pSignature);
static uint32_t PKA_ECDSAVerif_Result(CCB_HandleTypeDef *hccb);
static void CCB_PKA_RAMReset(CCB_HandleTypeDef *hccb);
#if (defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX))
HAL_StatusTypeDef CCB_RNG_ResilientRecoverSeedError(CCB_HandleTypeDef *hccb);
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */

