zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
/** @defgroup CCB_Exported_Functions_Group1 Initialization/de-initialization functions
  *  @brief Initialization and Configuration functions
  *
@verbatim
 ===============================================================================
            ##### Initialization and Configuration functions #####
 ===============================================================================
    [..]  This subsection provides a set of functions allowing to initialize and
          deinitialize the CCB peripheral:

      (+) User must implement HAL_CCB_MspInit() function in which he configures
          all related peripherals resources.

      (+) Call the function HAL_CCB_Init() to configure the device.

      (+) Call the function HAL_CCB_DeInit() to restore the default configuration
          of the selected CCB peripheral.

@endverbatim
  * @{
  */

/**
  * @brief  Initialize the CCB associated handle
  *         according to the specified parameters.
  * @param  hccb CCB handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CCB_Init(CCB_HandleTypeDef *hccb)
{
  /* Check the CCB handle allocation */
  if (hccb == NULL)
  {
    /* Return error */
    return HAL_ERROR;
  }

  /* Initialization of the hardware */
  HAL_CCB_MspInit(hccb);

  /* PKA RAM RESET*/
  CCB_PKA_RAMReset(hccb);

  /* Update the CCB state */
  hccb->State = HAL_CCB_STATE_READY;

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Initialize the CCB MSP.
  * @param  hccb CCB handle
  * @retval None
  */
__weak void HAL_CCB_MspInit(CCB_HandleTypeDef *hccb)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hccb);
  /* NOTE : This function should not be modified, when the callback is needed,
  the HAL_CCB_MspInit can be implemented in the user file
  */
}

/**
  * @brief  DeInitialize the CCB peripheral.
  * @param  hccb CCB handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CCB_DeInit(CCB_HandleTypeDef *hccb)
{
  /* Check the CCB handle allocation */
  if (hccb == NULL)
  {
    /* Return error */
    return HAL_ERROR;
  }

  /* Set CCB IPRST */
  SET_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* CCB is busy while CCB IPRST is in progress --> waiting flag */
  if (CCB_WaitFLAG(hccb, CCB_SR_BUSY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_TIMEOUT;
  }

  /* clear CCB IPRST */
  CLEAR_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* De-initialize the hardware */
  HAL_CCB_MspDeInit(hccb);

  /* Reset the driver state */
  hccb->State = HAL_CCB_STATE_RESET;

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  DeInitialize the CCB MSP.
  * @param  hccb CCB handle
  * @retval None
  */
__weak void HAL_CCB_MspDeInit(CCB_HandleTypeDef *hccb)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hccb);
  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_CCB_MspDeInit can be implemented in the user file
   */
}

/**
  * @}
  */

/** @defgroup CCB_Exported_Functions_Group2 Peripheral State and Errorfunctions
  *  @brief set symmetric key functions
  *
@verbatim
 ===============================================================================
            ##### Peripheral State and Error functions #####
 ===============================================================================
    [..]
    This subsection permit to get in run-time the status of the peripheral.

@endverbatim
  * @{
  */

/**
  * @brief  Return the CCB error code.
  * @param  hccb : pointer to a CCB_HandleTypeDef structure
  * @retval CCB error code
  */
uint32_t HAL_CCB_GetError(const CCB_HandleTypeDef *hccb)
{
  return hccb->ErrorCode;
}

/**
  * @brief  Returns the CCB state.
  * @param  hccb: pointer to a CCB_HandleTypeDef structure
  * @retval State code
  */
uint32_t HAL_CCB_GetState(const CCB_HandleTypeDef *hccb)
{
  return hccb->State;
}

/**
  * @brief  Return the CCB hardware operartion error code.
  * @param  hccb : pointer to a CCB_HandleTypeDef structure
  * @retval CCB hardware operartion error code
  */
uint32_t HAL_CCB_GetOperationError(const CCB_HandleTypeDef *hccb)
{
  return ((hccb->Instance->SR & 0x1F00U) >> 8U);
}

/**
  * @}
  */

/** @defgroup CCB_Exported_Functions_Group3 operation functions
  *  @brief set symmetric key functions
  *
@verbatim
 ===============================================================================
                         ##### operation functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to manage the CCB operations.

    (#) There are three type of CCB/PKA protected operations:
       (++) ECDSA sign : The operation is performed in the polling mode.
            These functions return when data operation is completed.
       (++) ECC Scalar Multiplication : The operation is performed using Interrupts.
            These functions return immediately.
            The end of the operation is indicated by HAL_PKA_ErrorCallback in case of error.
            The end of the operation is indicated by HAL_PKA_OperationCpltCallback in case of success.
            To stop any operation in interrupt mode, use HAL_PKA_Abort().
       (++) RSA Modular Exponentiation : The operation is performed using Interrupts.
            These functions return immediately.
            The end of the operation is indicated by HAL_PKA_ErrorCallback in case of error.
            The end of the operation is indicated by HAL_PKA_OperationCpltCallback in case of success.
            To stop any operation in interrupt mode, use HAL_PKA_Abort().

    (#) ECDSA sign functions are :
       (++) HAL_CCB_ECDSA_WrapPrivateKey()for blob creation.
       (++) HAL_CCB_ECDSA_GenerateWrapPrivateKey()for blob creation.
       (++) HAL_CCB_ECDSA_Sign() for blob usage.
       (++) HAL_CCB_ECDSA_ComputePublicKey() for blob usage.

    (#) ECC Scalar Multiplication functions are :
       (++) HAL_CCB_ECC_WrapPrivateKey()for blob creation.
       (++) HAL_CCB_ECC_GenerateWrapPrivateKey()for blob creation.
       (++) HAL_CCB_ECC_ComputeScalarMul() for blob usage.

    (#) RSA Modular Exponentiation functions are :
       (++) HAL_CCB_RSA_WrapPrivateKey()for blob creation.
       (++) HAL_CCB_RSA_ComputeModularExp() for blob usage.

@endverbatim
  * @{
  */
/**
  * @brief  ECDSA Wrap Symmetric Key.
  * @param  hccb CCB handle.
  * @param  pClearAESKey pointer to the clear AES Key.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_CCB_ECDSA_WrapSymmetricKey(CCB_HandleTypeDef *hccb, const uint32_t *pClearAESKey,
                                                 CCB_WrappingKeyTypeDef *pWrappingKey)
{
  return (CCB_WrapSymmetricKey(hccb, pClearAESKey, CCB_ECDSA_SIGN_CPU_BLOB_CREATION, pWrappingKey));
}

/**
  * @brief  ECC Wrap Symmetric Key.
  * @param  hccb CCB handle.
  * @param  pClearAESKey pointer to the clear AES Key.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_CCB_ECC_WrapSymmetricKey(CCB_HandleTypeDef *hccb, const uint32_t *pClearAESKey,
                                               CCB_WrappingKeyTypeDef *pWrappingKey)
{
  return (CCB_WrapSymmetricKey(hccb, pClearAESKey, CCB_ECC_SCALAR_MUL_CPU_BLOB_CREATION, pWrappingKey));
}

/**
  * @brief  RSA Wrap Symmetric Key.
  * @param  hccb CCB handle.
  * @param  pClearAESKey pointer to the clear AES Key.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_CCB_RSA_WrapSymmetricKey(CCB_HandleTypeDef *hccb, const uint32_t *pClearAESKey,
                                               CCB_WrappingKeyTypeDef *pWrappingKey)
{
  return (CCB_WrapSymmetricKey(hccb, pClearAESKey, CCB_MODULAR_EXP_CPU_BLOB_CREATION, pWrappingKey));
}

/**
  * @brief  Blob Creation: ECDSA Wrap the private Key (input from user).
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pClearPrivateKey pointer to the clear private key.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pWrappedPrivateKeyBlob pointer to the related wrapped Private Key Blob.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_CCB_ECDSA_WrapPrivateKey(CCB_HandleTypeDef *hccb, CCB_ECDSACurveParamTypeDef *pCurveParam,
                                               const uint8_t *pClearPrivateKey, CCB_WrappingKeyTypeDef *pWrappingKey,
                                               const CCB_ECDSAKeyBlobTypeDef *pWrappedPrivateKeyBlob)
{
  uint32_t count;
  __IO uint16_t f_count;
#if  defined(SW_SANITY_CHECK_SUPPORT)
  uint16_t random0 = 0;
  uint8_t integer[80U] = {0};
#endif /* GENERATOR_SW_SANITY_CHECK_AVAILABLE_ALL_DEVICES */
  uint16_t random1 = 0;
  uint16_t random2 = 0;
  uint16_t random3 = 0;
  uint32_t key_size;
  uint32_t tickstart;

