zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
  uint8_t hash[80U] = {0};
  uint8_t r_sign[80U] = {0};
  uint8_t s_sign[80U] = {0};
  uint8_t point_x[80U] = {0};
  uint8_t point_y[80U] = {0};
  uint32_t iv_temp[4] = {0};
  uint32_t tag_temp[4] = {0};
  uint32_t wrapped_key_temp[80U] = {0};

  CCB_ECDSASignTypeDef signature = {r_sign, s_sign};
  CCB_ECCMulPointTypeDef publicKeyOut = {(uint8_t *)point_x, (uint8_t *)point_y};

  if (CCB_RNG_Init(hccb) != HAL_OK)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  for (count = 0U; count < (pCurveParam->primeOrderSizeByte); count++)
  {
    if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_ERROR;
    }

    tickstart = HAL_GetTick();

    while (hash[count] == 0U)
    {
      hash[count] = (uint8_t)((HAL_CCB_GET_RNG_INSTANCE(hccb)->DR) & 0x000000FFU);
      if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
      {
        /* Set state and return error */
        return HAL_ERROR;
      }
    }
  }

  if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  tickstart = HAL_GetTick();

  while (random1 == 0U)
  {
    random1 = (uint16_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0x3FFU);
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Set state and return error */
      return HAL_ERROR;
    }
  }

  if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  tickstart = HAL_GetTick();

  while (random2 == 0U)
  {
    random2 = (uint16_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0x3FFU);
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Set state and return error */
      return HAL_ERROR;
    }
  }

  if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  tickstart = HAL_GetTick();

  while (random3 == 0U)
  {
    random3 = (uint16_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0x3FFU);
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Set state and return error */
      return HAL_ERROR;
    }
  }
  if (hccb->State == HAL_CCB_STATE_READY)
  {
#if  defined(SW_SANITY_CHECK_SUPPORT)
    tickstart = HAL_GetTick();

    while (random0 == 0U)
    {
      random0 = (uint16_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0x3FFU);
      if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
      {
        /* Set state and return error */
        return HAL_ERROR;
      }
    }

    if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_ERROR;
    }

    for (count = 0U; count < (pCurveParam->primeOrderSizeByte); count++)
    {
      tickstart = HAL_GetTick();

      while (integer[count] == 0U)
      {
        integer[count] = (uint8_t)((HAL_CCB_GET_RNG_INSTANCE(hccb)->DR) & 0x000000FFU);
        if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
        {
          /* Set state and return error */
          return HAL_ERROR;
        }
      }

      if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return HAL_ERROR;
      }
    }

    if (Unprotected_PKA_Init(hccb) != HAL_OK)
    {
      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

    if (PKA_ECDSASign(hccb, pCurveParam, pClearPrivateKey, (uint8_t *)integer, (uint8_t *)hash,
                      &signature) != HAL_OK)
    {
      if (PKA_RAM_Erase(hccb) != HAL_OK)
      {
        hccb->ErrorCode |= HAL_CCB_ERROR_PKARAM_ERASE;
      }
      return HAL_ERROR;
    }

    f_count = 0;
    while (f_count < random0)
    {
      f_count++;
    }

    /* Signature blob creation */
    if (CCB_ECDSA_SignBlobCreation(hccb, pCurveParam, pClearPrivateKey, pWrappingKey, iv_temp, tag_temp,
                                   wrapped_key_temp, NULL, NULL, CCB_ECDSA_SIGN_CPU_BLOB_CREATION) != HAL_OK)
    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }

    /* Reset each element in the PKA RAM */
    for (uint32_t index = 0U; index < CCB_PKA_RAM_SIZE; index++)
    {
      /* Clear the content */
      HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[index] = 0UL;
    }
#elif   defined (HW_SANITY_CHECK_SUPPORT)
    /* Signature blob creation */
    if (CCB_ECDSA_SignBlobCreation(hccb, pCurveParam, pClearPrivateKey, pWrappingKey, iv_temp, tag_temp,
                                   wrapped_key_temp, hash, &signature, CCB_ECDSA_SIGN_CPU_BLOB_CREATION) != HAL_OK)
    {
      return HAL_ERROR;
    }

#endif /* GENERATOR_SW_SANITY_CHECK_AVAILABLE_ALL_DEVICES */
    /* Create ECDSA public key */
    if (CCB_ECC_ComputeScalarMul(hccb, pCurveParam, pWrappingKey, iv_temp, tag_temp,
                                 wrapped_key_temp, NULL, &publicKeyOut, NULL,
                                 CCB_COMPUTE_PUBLIC_KEY) != HAL_OK)
    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }

    if (Unprotected_PKA_Init(hccb) != HAL_OK)
    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }

    /* PKA ECDSA valid R & S signature */
    if (PKA_ECDSAVerif(hccb, pCurveParam, &publicKeyOut, hash, &signature) != HAL_OK)
    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }

    f_count = 0;
    while (f_count < random1)
    {
      f_count++;
    }

    /* Check if it is valid signature and improve robustness against intrusion (intentional) */
    if ((PKA_ECDSAVerif_Result(hccb) != CCB_PKA_ECDSA_VERIF_OK) || (f_count != random1) || (f_count == 0U))
    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }

    f_count = 0;
    while (f_count < random2)
    {
      f_count++;
    }

