zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
    /* Check if it is valid signature and improve robustness against intrusion (intentional) */
    if ((PKA_ECDSAVerif_Result(hccb) != CCB_PKA_ECDSA_VERIF_OK) || (f_count != random2) || (f_count == 0U))
    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }

    f_count = 0;
    while (f_count < random3)
    {
      f_count++;
    }

    /* Check if it is valid signature and improve robustness against intrusion (intentional) */
    if ((PKA_ECDSAVerif_Result(hccb) != CCB_PKA_ECDSA_VERIF_OK) || (f_count != random3) || (f_count == 0U))
    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }
  }

  else
  {
    /* Set state, error code and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    hccb->ErrorCode = HAL_CCB_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Update the CCB state */
  hccb->State = HAL_CCB_STATE_READY;

  /* Export created Blob */
  key_size = CCB_get_cipherkey_size(pCurveParam);
  for (count = 0U; count < key_size; count++)
  {
    if (count < CCB_BLOCK_SIZE)
    {
      pWrappedPrivateKeyBlob->pIV[count] = iv_temp[count];
      pWrappedPrivateKeyBlob->pTag[count] = tag_temp[count];
    }
    pWrappedPrivateKeyBlob->pWrappedKey[count] = wrapped_key_temp[count];
  }

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Blob Creation: ECDSA generate (by RNG) and wrap the private Key (no user input).
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pWrappedPrivateKeyBlob pointer to the related wrapped Private Key Blob.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_CCB_ECDSA_GenerateWrapPrivateKey(CCB_HandleTypeDef *hccb,
                                                       CCB_ECDSACurveParamTypeDef *pCurveParam,
                                                       CCB_WrappingKeyTypeDef *pWrappingKey,
                                                       CCB_ECDSAKeyBlobTypeDef *pWrappedPrivateKeyBlob)
{
  uint32_t  count;
  uint32_t key_size;
  uint32_t iv_temp[4] = {0};
  uint32_t tag_temp[4] = {0};
  uint32_t wrapped_key_temp[80U] = {0};

#if   defined (HW_SANITY_CHECK_SUPPORT)
  uint32_t tickstart;
  __IO uint16_t f_count;
  uint16_t random1 = 0;
  uint16_t random2 = 0;
  uint16_t random3 = 0;
  uint8_t hash[80U] = {0};
  uint8_t r_sign[80U] = {0};
  uint8_t s_sign[80U] = {0};
  uint8_t point_x[80U] = {0};
  uint8_t point_y[80U] = {0};

  CCB_ECDSASignTypeDef signature = {r_sign, s_sign};
  CCB_ECCMulPointTypeDef public_key_out = {(uint8_t *)point_x, (uint8_t *)point_y};
#endif /* GENERATOR_HW_SANITY_CHECK_AVAILABLE_ALL_DEVICES */

  if (hccb->State == HAL_CCB_STATE_READY)
  {
#if  defined(SW_SANITY_CHECK_SUPPORT)
    /* Signature blob creation */
    if (CCB_ECDSA_SignBlobCreation(hccb, pCurveParam, NULL, pWrappingKey, iv_temp, tag_temp, wrapped_key_temp,
                                   NULL, NULL, CCB_ECDSA_SIGN_RNG_BLOB_CREATION) != HAL_OK)
    {
      /* Set state, error code and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }
#elif   defined (HW_SANITY_CHECK_SUPPORT)
    if (CCB_RNG_Init(hccb) != HAL_OK)
    {
      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

    tickstart = HAL_GetTick();

    while (random1 == 0U)
    {
      random1 = (uint16_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0x3FFU);
      if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
      {
        /* Set state and return error */
        return HAL_ERROR;
      }
    }

    if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_ERROR;
    }

    tickstart = HAL_GetTick();

    while (random2 == 0U)
    {
      random2 = (uint16_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0x3FFU);
      if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
      {
        /* Set state and return error */
        return HAL_ERROR;
      }
    }

    if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_ERROR;
    }

    tickstart = HAL_GetTick();

    while (random3 == 0U)
    {
      random3 = (uint16_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0x3FFU);
      if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
      {
        /* Set state and return error */
        return HAL_ERROR;
      }
    }

    for (count = 0U; count < (pCurveParam->primeOrderSizeByte); count++)
    {
      if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return HAL_ERROR;
      }

      tickstart = HAL_GetTick();

      while (hash[count] == 0U)
      {
        hash[count] = (uint8_t)((HAL_CCB_GET_RNG_INSTANCE(hccb)->DR) & 0x000000FFU);
        if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
        {
          /* Set state and return error */
          return HAL_ERROR;
        }
      }
    }
    /* Signature blob creation */
    if (CCB_ECDSA_SignBlobCreation(hccb, pCurveParam, NULL, pWrappingKey, iv_temp, tag_temp, wrapped_key_temp,
                                   (uint8_t *)hash,
                                   &signature, CCB_ECDSA_SIGN_RNG_BLOB_CREATION) != HAL_OK)

    {
      /* Set state, error code and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

    /* Reset each element in the PKA RAM */
    for (uint32_t index = 0U; index < CCB_PKA_RAM_SIZE; index++)
    {
      /* Clear the content */
      HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[index] = 0UL;
    }
    /* Create ECDSA public key */
    if (CCB_ECC_ComputeScalarMul(hccb, pCurveParam, pWrappingKey, iv_temp, tag_temp, wrapped_key_temp, NULL,
                                 &public_key_out, NULL, CCB_COMPUTE_PUBLIC_KEY) != HAL_OK)
    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }

    if (Unprotected_PKA_Init(hccb) != HAL_OK)
    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }

    /* PKA ECDSA valid R & S signature */
    if (PKA_ECDSAVerif(hccb, pCurveParam, &public_key_out, hash, &signature) != HAL_OK)
    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }

    f_count = 0;
    while (f_count < random1)
    {
      f_count++;
    }

