zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
        /* Write key in PKA RAM */
        for (count = 0UL; count < 4UL; count++)
        {
          HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D + count_block + count] = CCB_MAGIC_VALUE;
        }
        count_block += 4UL;
      }
    }

    if ((operand_size % 4UL) != 0UL)
    {
      RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM, PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D + cipherkey_size);
    }
    /* Wait until DATAOKF flag is SET in PKA and trig OPSTEP transition 0x14 --> 0x16 */
    if (Protect_PKA_WaitFLAG(hccb, PKA_SR_DATAOKF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Wait until OPSTEP is set to 0x16 */
    if (CCB_WaitOperStep(hccb, 0x16, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Write random k */
    for (offset = 0UL; offset < (operand_size - 2UL); offset++)
    {
      /* Wait for RNG Data Ready flag */
      if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        /* return error */
        return HAL_ERROR;
      }
      HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_K + offset] = CCB_FAKE_VALUE;
    }

    /*  Padding at zero */
    RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM, PKA_ECDSA_SIGN_IN_K + offset);

    /* Wait for PKA RNGOK flag : GCMPH = 0x3 (final phase) as events that trig OPSTEP transition 0x16 --> 0x17 */
    if (Protect_PKA_WaitFLAG(hccb, PKA_SR_RNGOKF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Wait until OPSTEP is set to 0x17 */
    if (CCB_WaitOperStep(hccb, 0x17, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Final phase processing */
    if (CCB_BlobUse_FinalPhase(hccb, CCB_ECDSA_SIGN_BLOB_USE, pCurveParam->modulusSizeByte) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Wait until OPSTEP is set to 0x18 */
    if (CCB_WaitOperStep(hccb, 0x18, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* SET PKA START operation bit and trig OPSTEP transition 0x18 --> 0x19 */
    SET_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_START);

    /* Wait until OPSTEP is set to 0x19 */
    if (CCB_WaitOperStep(hccb, 0x19, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Wait until end of operation flag is SET in PKA and trig OPSTEP transition 0x19 --> 0x1A */
    if (Protect_PKA_WaitFLAG(hccb, PKA_SR_PROCENDF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Wait until OPSTEP is set to 0x1A */
    if (CCB_WaitOperStep(hccb, 0x1A, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Check PKA Operation error result */
    if ((HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_OUT_ERROR]) !=  CCB_PKA_ERROR_OPERATION_NONE)
    {
      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }
    /* Read r part signature */
    CCB_Memcpy_u32_to_u8(pSignature->pRSign, &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_OUT_SIGNATURE_R],
                         pCurveParam->modulusSizeByte);
    /* Read s part signature */
    CCB_Memcpy_u32_to_u8(pSignature->pSSign, &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_OUT_SIGNATURE_S],
                         pCurveParam->modulusSizeByte);


    /* set CCB IPRST  */
    SET_BIT(hccb->Instance->CR, CCB_CR_IPRST);

    /* CCB is busy while CCB IPRST is in progress */
    if (CCB_WaitFLAG(hccb, CCB_SR_BUSY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }

    /* clear CCB IPRST */
    CLEAR_BIT(hccb->Instance->CR, CCB_CR_IPRST);

    /* Update the CCB state */
    hccb->State = HAL_CCB_STATE_READY;
  }

  else
  {
    /* Set state, error code and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    hccb->ErrorCode = HAL_CCB_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Blob Usage: ECDSA Compute Public Key.
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pWrappedPrivateKeyBlob pointer to the related wrapped Private Key Blob.
  * @param  pPublicKey pointer to the output public key.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_CCB_ECDSA_ComputePublicKey(CCB_HandleTypeDef *hccb, CCB_ECDSACurveParamTypeDef *pCurveParam,
                                                 CCB_WrappingKeyTypeDef *pWrappingKey,
                                                 CCB_ECDSAKeyBlobTypeDef *pWrappedPrivateKeyBlob,
                                                 CCB_ECCMulPointTypeDef *pPublicKey)
{
  if (hccb->State == HAL_CCB_STATE_READY)
  {
    if (CCB_ECC_ComputeScalarMul(hccb, pCurveParam, pWrappingKey, pWrappedPrivateKeyBlob->pIV,
                                 pWrappedPrivateKeyBlob->pTag, pWrappedPrivateKeyBlob->pWrappedKey, NULL, pPublicKey,
                                 NULL, CCB_COMPUTE_PUBLIC_KEY) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }

  else
  {
    /* Set state, error code and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    hccb->ErrorCode = HAL_CCB_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Blob Creation: ECC Wrap the private Key (input from user).
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pClearPrivateKey pointer to the clear private key.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pWrappedPrivateKeyBlob pointer to the related wrapped Private Key Blob.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_CCB_ECC_WrapPrivateKey(CCB_HandleTypeDef *hccb, CCB_ECCMulCurveParamTypeDef *pCurveParam,
                                             const uint8_t *pClearPrivateKey, CCB_WrappingKeyTypeDef *pWrappingKey,
                                             CCB_ECCMulKeyBlobTypeDef *pWrappedPrivateKeyBlob)
{
#if  defined(SW_SANITY_CHECK_SUPPORT)
  uint8_t random = 0;
  __IO uint8_t f_count;
  uint32_t tickstart;
#endif /* GENERATOR_SW_SANITY_CHECK_AVAILABLE_ALL_DEVICES */
  uint32_t public_key[2][20] = {{0UL}, {0UL}};
  uint32_t count;
  uint32_t key_size;
  uint32_t iv_temp[4] = {0};
  uint32_t tag_temp[4] = {0};
  uint32_t wrapped_key_temp[80] = {0};

  if (hccb->State == HAL_CCB_STATE_READY)
  {
#if  defined(SW_SANITY_CHECK_SUPPORT)
    if (Unprotected_PKA_Init(hccb) != HAL_OK)
    {
      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

