zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
    if (CCB_RNG_Init(hccb) != HAL_OK)
    {
      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

    if (PKA_ECC_ComputeScalarMul(hccb, pCurveParam, pClearPrivateKey, public_key) != HAL_OK)
    {
      if (PKA_RAM_Erase(hccb) != HAL_OK)
      {
        hccb->ErrorCode |= HAL_CCB_ERROR_PKARAM_ERASE;
      }
      return HAL_ERROR;
    }

    if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_ERROR;
    }

    tickstart = HAL_GetTick();

    while (random == 0U)
    {
      random = (uint8_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0xFFU);
      if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
      {
        /* Set state and return error */
        return HAL_ERROR;
      }
    }

    f_count = 0;
    while (f_count < random)
    {
      f_count++;
    }

    if (CCB_ECC_ScalarMulBlobCreation(hccb, pCurveParam, pClearPrivateKey, pWrappingKey,
                                      iv_temp, tag_temp, wrapped_key_temp, NULL,
                                      CCB_ECC_SCALAR_MUL_CPU_BLOB_CREATION) != HAL_OK)
    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }

#elif   defined (HW_SANITY_CHECK_SUPPORT)
    /* CCB ECC generate private wrap key */
    if (CCB_ECC_ScalarMulBlobCreation(hccb, pCurveParam, pClearPrivateKey, pWrappingKey,
                                      iv_temp, tag_temp, wrapped_key_temp, public_key,
                                      CCB_ECC_SCALAR_MUL_CPU_BLOB_CREATION) != HAL_OK)
    {
      return HAL_ERROR;
    }

#endif /* GENERATOR_HW_SANITY_CHECK_AVAILABLE_ALL_DEVICES */
    /* Compute CCB public key */
    if (CCB_ECC_ComputeScalarMul(hccb, pCurveParam, pWrappingKey, iv_temp, tag_temp, wrapped_key_temp, NULL,
                                 NULL, &public_key[0][0], CCB_VERIF_OPERATION_ENABLED) != HAL_OK)

    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }

  }

  else
  {
    /* Set state, error code and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    hccb->ErrorCode = HAL_CCB_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Update the CCB state */
  hccb->State = HAL_CCB_STATE_READY;

  /* Export created Blob */
  key_size = CCB_get_cipherkey_size(pCurveParam);
  for (count = 0U; count < key_size; count++)
  {
    if (count < CCB_BLOCK_SIZE)
    {
      pWrappedPrivateKeyBlob->pIV[count] = iv_temp[count];
      pWrappedPrivateKeyBlob->pTag[count] = tag_temp[count];
    }
    pWrappedPrivateKeyBlob->pWrappedKey[count] = wrapped_key_temp[count];
  }

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Blob Creation: ECC generate (by RNG) and wrap the private Key (no user input).
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pWrappedPrivateKeyBlob pointer to the related wrapped Private Key Blob.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_CCB_ECC_GenerateWrapPrivateKey(CCB_HandleTypeDef *hccb,
                                                     CCB_ECCMulCurveParamTypeDef *pCurveParam,
                                                     CCB_WrappingKeyTypeDef *pWrappingKey,
                                                     CCB_ECCMulKeyBlobTypeDef *pWrappedPrivateKeyBlob)
{
#if   defined (HW_SANITY_CHECK_SUPPORT)
  uint32_t PublicKey[2U][20U] = {0U};
#endif /* GENERATOR_HW_SANITY_CHECK_AVAILABLE_ALL_DEVICES */
  uint32_t count;
  uint32_t key_size;
  uint32_t iv_temp[4] = {0};
  uint32_t tag_temp[4] = {0};
  uint32_t wrapped_key_temp[80] = {0};
  if (hccb->State == HAL_CCB_STATE_READY)
  {
#if   defined (HW_SANITY_CHECK_SUPPORT)
    /* CCB ECC generate private wrap key */
    if (CCB_ECC_ScalarMulBlobCreation(hccb, pCurveParam, NULL, pWrappingKey,
                                      iv_temp, tag_temp, wrapped_key_temp, PublicKey,
                                      CCB_ECC_SCALAR_MUL_RNG_BLOB_CREATION) != HAL_OK)
    {
      return HAL_ERROR;
    }

    /* Compute ECC public key */
    if (CCB_ECC_ComputeScalarMul(hccb, pCurveParam, pWrappingKey, iv_temp, tag_temp, wrapped_key_temp,
                                 NULL, NULL, &PublicKey[0][0], CCB_VERIF_OPERATION_ENABLED) != HAL_OK)
    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }
#elif  defined(SW_SANITY_CHECK_SUPPORT)

    /* CCB ECC generate private wrap key */
    if (CCB_ECC_ScalarMulBlobCreation(hccb, pCurveParam, NULL, pWrappingKey,
                                      iv_temp, tag_temp, wrapped_key_temp, NULL,
                                      CCB_ECC_SCALAR_MUL_RNG_BLOB_CREATION) != HAL_OK)
    {
      return HAL_ERROR;
    }
#endif /* GENERATOR_HW_SANITY_CHECK_AVAILABLE_ALL_DEVICES */
  }
  else
  {
    /* Set state, error code and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    hccb->ErrorCode = HAL_CCB_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Update the CCB state */
  hccb->State = HAL_CCB_STATE_READY;
  /* Export created Blob */
  key_size = CCB_get_cipherkey_size(pCurveParam);
  for (count = 0U; count < key_size; count++)
  {
    if (count < CCB_BLOCK_SIZE)
    {
      pWrappedPrivateKeyBlob->pIV[count] = iv_temp[count];
      pWrappedPrivateKeyBlob->pTag[count] = tag_temp[count];
    }
    pWrappedPrivateKeyBlob->pWrappedKey[count] = wrapped_key_temp[count];
  }

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Blob Usage: ECC Compute Scalar Multiplication.
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pInputPoint pointer to the input point structure.
  * @param  pWrappedPrivateKeyBlob pointer to the related wrapped Private Key Blob.
  * @param  pOutputPoint pointer to the output point.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_CCB_ECC_ComputeScalarMul(CCB_HandleTypeDef *hccb, CCB_ECCMulCurveParamTypeDef *pCurveParam,
                                               CCB_WrappingKeyTypeDef *pWrappingKey,
                                               CCB_ECCMulKeyBlobTypeDef *pWrappedPrivateKeyBlob,
                                               CCB_ECCMulPointTypeDef *pInputPoint,
                                               CCB_ECCMulPointTypeDef *pOutputPoint)
{
  if (hccb->State == HAL_CCB_STATE_READY)
  {
    if (CCB_ECC_ComputeScalarMul(hccb, pCurveParam, pWrappingKey, pWrappedPrivateKeyBlob->pIV,
                                 pWrappedPrivateKeyBlob->pTag, pWrappedPrivateKeyBlob->pWrappedKey,
                                 pInputPoint, pOutputPoint, NULL, CCB_VERIF_OPERATION_DISABLED) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }

  else
  {
    /* Set state, error code and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    hccb->ErrorCode = HAL_CCB_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Blob Creation: RSA Wrap the private Key (input from user).
  * @param  hccb CCB handle.
  * @param  pParam pointer to the modular exponatiation parameters.
  * @param  pRSAClearPrivateKey pointer to the clear Private Key.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pWrappedPrivateKeyBlob pointer to the related wrapped Private Key Blob.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_CCB_RSA_WrapPrivateKey(CCB_HandleTypeDef *hccb, CCB_RSAParamTypeDef *pParam,
                                             const CCB_RSAClearKeyTypeDef *pRSAClearPrivateKey,
                                             CCB_WrappingKeyTypeDef *pWrappingKey,
                                             CCB_RSAKeyBlobTypeDef *pWrappedPrivateKeyBlob)
{
  uint8_t  exp_base[520U] = {0};
  uint32_t count;
#if  defined(SW_SANITY_CHECK_SUPPORT)
  __IO uint16_t f_count;
  uint16_t random0 = 0;
#endif /* GENERATOR_SW_SANITY_CHECK_AVAILABLE_ALL_DEVICES */
  uint32_t modular_exp_ref[520U] = {0};
  uint32_t operand_size;
  uint32_t cipherkey_size;
  uint32_t iv_temp[4] = {0};
  uint32_t tag_temp[4] = {0};
  uint32_t wrapped_exp[520U] = {0};
  uint32_t wrapped_phi[520U] = {0};
  uint32_t tickstart;

  if (hccb->State == HAL_CCB_STATE_READY)
  {
    if (CCB_RNG_Init(hccb) != HAL_OK)
    {
      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

    for (uint32_t offset = 0U; offset < pParam->modulusSizeByte; offset++)
    {
      if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return HAL_ERROR;
      }

      tickstart = HAL_GetTick();

      while (exp_base[offset] == 0U)
      {
        exp_base[offset] = (uint8_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0xFFU);
        if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
        {
          /* Set state and return error */
          return HAL_ERROR;
        }
      }
    }

#if  defined(SW_SANITY_CHECK_SUPPORT)
    if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_ERROR;
    }

    tickstart = HAL_GetTick();

    while (random0 == 0U)
    {
      random0 = (uint16_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0x3FFU);
      if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
      {
        /* Set state and return error */
        return HAL_ERROR;
      }
    }

    if (Unprotected_PKA_Init(hccb) != HAL_OK)
    {
      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

    if (PKA_RSA_ComputeModularExp(hccb, pParam, pRSAClearPrivateKey, (uint8_t *)exp_base, modular_exp_ref) != HAL_OK)
    {
      if (PKA_RAM_Erase(hccb) != HAL_OK)
      {
        hccb->ErrorCode |= HAL_CCB_ERROR_PKARAM_ERASE;
      }
      return  HAL_ERROR;
    }

    if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_ERROR;
    }

    f_count = 0;
    while (f_count < random0)
    {
      f_count++;
    }

    if (CCB_RSA_ExpBlobCreation(hccb, pParam, pRSAClearPrivateKey, pWrappingKey, iv_temp, tag_temp, wrapped_exp,
                                wrapped_phi, NULL, NULL) != HAL_OK)
    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }
#elif   defined (HW_SANITY_CHECK_SUPPORT)
    if (CCB_RSA_ExpBlobCreation(hccb, pParam, pRSAClearPrivateKey, pWrappingKey, iv_temp, tag_temp, wrapped_exp,
                                wrapped_phi, (uint8_t *)exp_base, modular_exp_ref) != HAL_OK)
    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }
#endif /* GENERATOR_SW_SANITY_CHECK_AVAILABLE_ALL_DEVICES */

    if (CCB_RSA_ComputeModularExp(hccb, pParam, pWrappingKey, iv_temp, tag_temp, wrapped_exp, wrapped_phi,
                                  (uint8_t *)exp_base, NULL, modular_exp_ref,
                                  CCB_VERIF_OPERATION_ENABLED) != HAL_OK)
    {
      /* Set state, and intrusion error */
      hccb->State = HAL_CCB_STATE_ERROR;
      HAL_CCB_IntrusionCallback(hccb);
    }
  }

  else
  {
    /* Set state, error code and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    hccb->ErrorCode = HAL_CCB_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Update the CCB state */
  hccb->State = HAL_CCB_STATE_READY;

