zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
  /* Wait the INITOK flag Setting */
  if (Protect_PKA_WaitFLAG(hccb, PKA_SR_INITOK, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
#if (defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX))
    /*Check if there is an RNG seed error */
    if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
    {
      /* Attempt to recover from the seed error */
      if (CCB_RNG_ResilientRecoverSeedError(hccb) != HAL_OK)
      {
        return HAL_ERROR;
      }
    }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
  }

  /* Reset any pending flag */
  SET_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CLRFR,
          PKA_CLRFR_PROCENDFC | PKA_CLRFR_RAMERRFC | PKA_CLRFR_ADDRERRFC | PKA_CLRFR_OPERRFC);

  /* Set the mode and deactivate the interrupts */
  if ((Operation == CCB_ECDSA_SIGN_CPU_BLOB_CREATION)
      || (Operation == CCB_ECDSA_SIGN_RNG_BLOB_CREATION)
      || (Operation == CCB_ECDSA_SIGN_BLOB_USE))
  {
    MODIFY_REG(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_MODE | PKA_CR_PROCENDIE | PKA_CR_RAMERRIE | PKA_CR_ADDRERRIE
               | PKA_CR_OPERRIE, CCB_PKA_ECDSA_SIGNATURE_MODE << PKA_CR_MODE_Pos);
  }

  else if ((Operation == CCB_ECC_SCALAR_MUL_CPU_BLOB_CREATION)
           || (Operation == CCB_ECC_SCALAR_MUL_RNG_BLOB_CREATION)
           || (Operation == CCB_ECC_SCALAR_MUL_BLOB_USE))
  {
    MODIFY_REG(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_MODE | PKA_CR_PROCENDIE | PKA_CR_RAMERRIE | PKA_CR_ADDRERRIE
               | PKA_CR_OPERRIE, CCB_PKA_ECC_MUL_MODE << PKA_CR_MODE_Pos);
  }

  else if ((Operation == CCB_MODULAR_EXP_CPU_BLOB_CREATION)
           || (Operation == CCB_MODULAR_EXP_BLOB_USE))
  {
    MODIFY_REG(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_MODE | PKA_CR_PROCENDIE | PKA_CR_RAMERRIE | PKA_CR_ADDRERRIE
               | PKA_CR_OPERRIE, CCB_PKA_MODE_MODULAR_EXP_PROTECT << PKA_CR_MODE_Pos);
  }
  else
  {
    /* do nothing */
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Unprotected PKA Initialization
  * @param  hccb CCB handle
  * @retval HAL status.
  */
static HAL_StatusTypeDef Unprotected_PKA_Init(CCB_HandleTypeDef *hccb)
{
  uint32_t tickstart = HAL_GetTick();

  /* Reset the control register and enable the PKA (wait the end of PKA RAM erase) */
  while ((HAL_CCB_GET_PKA_INSTANCE(hccb)->CR & PKA_CR_EN) != PKA_CR_EN)
  {
    HAL_CCB_GET_PKA_INSTANCE(hccb)->CR = PKA_CR_EN;

    /* Check the Timeout */
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Set timeout status */
      break;
    }
  }
  /* Wait the INITOK flag Setting */
  if (Unprotect_PKA_WaitFLAG(hccb, PKA_SR_INITOK, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
#if (defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX))
    /*Check if there is an RNG seed error */
    if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
    {
      /* Attempt to recover from the seed error */
      if (CCB_RNG_ResilientRecoverSeedError(hccb) != HAL_OK)
      {
        return HAL_ERROR;
      }
    }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
  }

  /* Reset any pending flag */
  SET_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CLRFR,
          PKA_CLRFR_PROCENDFC | PKA_CLRFR_RAMERRFC | PKA_CLRFR_ADDRERRFC | PKA_CLRFR_OPERRFC);

  return HAL_OK;
}

/**
  * @brief  Initialize the RNG
  * @param  hccb CCB handle
  * @retval HAL status
  */
static HAL_StatusTypeDef CCB_RNG_Init(CCB_HandleTypeDef *hccb)
{
  uint32_t tickstart;

  /* Disable RNG */
  HAL_CCB_GET_RNG_INSTANCE(hccb)->CR &= ~RNG_CR_RNGEN;

  /* Clock Error Detection Configuration when CONDRT bit is set to 1 */
  MODIFY_REG(HAL_CCB_GET_RNG_INSTANCE(hccb)->CR, RNG_CR_CONDRST,  RNG_CR_CONDRST);
#if defined(RNG_CR_NIST_VALUE)
  /* Recommended value for NIST compliance, refer to application note AN4230 */
  WRITE_REG(HAL_CCB_GET_RNG_INSTANCE(hccb)->CR, RNG_CR_NIST_VALUE | RNG_CR_CONDRST);
#endif /* defined(RNG_CR_NIST_VALUE) */
#if defined(RNG_HTCR_NIST_VALUE)
  /* Recommended value for NIST compliance, refer to application note AN4230 */
  WRITE_REG(HAL_CCB_GET_RNG_INSTANCE(hccb)->HTCR[0], RNG_HTCR_NIST_VALUE);
#endif /* defined(RNG_HTCR_NIST_VALUE) */
#if defined(RNG_NSCR_NIST_VALUE)
  WRITE_REG(HAL_CCB_GET_RNG_INSTANCE(hccb)->NSCR, RNG_NSCR_NIST_VALUE);
#endif /* defined(RNG_NSCR_NIST_VALUE) */

  /* Writing bit CONDRST=0 */
  CLEAR_BIT(HAL_CCB_GET_RNG_INSTANCE(hccb)->CR, RNG_CR_CONDRST);

  /* Get tick */
  tickstart = HAL_GetTick();

  /* Wait for conditioning reset process to be completed */
  while (HAL_IS_BIT_SET(HAL_CCB_GET_RNG_INSTANCE(hccb)->CR, RNG_CR_CONDRST))
  {
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* New check to avoid false timeout detection in case of preemption */
      if (HAL_IS_BIT_SET(HAL_CCB_GET_RNG_INSTANCE(hccb)->CR, RNG_CR_CONDRST))
      {
        /* Set state and return error */
        return HAL_ERROR;
      }
    }
  }

  /* Enable the RNG Peripheral */
  HAL_CCB_GET_RNG_INSTANCE(hccb)->CR |=  RNG_CR_RNGEN;

  tickstart = HAL_GetTick();

  /* Check if data register contains valid random data */
  while (HAL_IS_BIT_CLR(HAL_CCB_GET_RNG_INSTANCE(hccb)->SR, RNG_SR_DRDY))
  {
#if (defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX))
    /*Check if there is an RNG seed error */
    if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
    {
      /* Attempt to recover from the seed error */
      if (CCB_RNG_ResilientRecoverSeedError(hccb) != HAL_OK)
      {
        return HAL_ERROR;
      }
    }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */

    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      HAL_CCB_GET_RNG_INSTANCE(hccb)->CR &= ~RNG_CR_RNGEN;

      /* Set state and return error */
      return HAL_ERROR;
    }
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Wait CCB wrapping key configuration
  * @param  hccb CCB handle
  * @param  Operation Operation
  * @param  pWrappingKey pointer to the wrapping key structure
  * @retval HAL status
  */
static HAL_StatusTypeDef WrappingKeyConfiguration(CCB_HandleTypeDef *hccb, uint32_t Operation,
                                                  CCB_WrappingKeyTypeDef *pWrappingKey)
{
  uint32_t tmp;

