zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
  if (dst != NULL)
  {
    if (src != NULL)
    {
      for (; index < (size / 4UL); index++)
      {
        /* Apply the equivalent of __REV from uint8_t to uint32_t */
        dst[index] = ((uint32_t)src[(size - (index * 4UL) - 1UL)]) \
                     | ((uint32_t)src[(size - (index * 4UL) - 2UL)] << 8UL) \
                     | ((uint32_t)src[(size - (index * 4UL) - 3UL)] << 16UL) \
                     | ((uint32_t)src[(size - (index * 4UL) - 4UL)] << 24UL);
      }

      /* Manage the buffers not aligned on uint32_t */
      if ((size % 4UL) == 1UL)
      {
        dst[index] = (uint32_t)src[(size - (index * 4UL) - 1UL)];
      }
      else if ((size % 4UL) == 2UL)
      {
        dst[index] = ((uint32_t)src[(size - (index * 4UL) - 1UL)]) \
                     | ((uint32_t)src[(size - (index * 4UL) - 2UL)] << 8UL);
      }
      else if ((size % 4UL) == 3UL)
      {
        dst[index] = ((uint32_t)src[(size - (index * 4UL) - 1UL)]) \
                     | ((uint32_t)src[(size - (index * 4UL) - 2UL)] << 8UL) \
                     | ((uint32_t)src[(size - (index * 4UL) - 3UL)] << 16UL);
      }
      else
      {
        /* The last element is already handle in the loop */
      }
    }
  }
}

/**
  * @brief  Copy uint32_t array to uint32_t array.
  * @param  dst Pointer to destination
  * @param  src Pointer to source
  * @param  n Number of u32 to be handled
  * @retval None.
  */
void CCB_Memcpy_u32_to_u32(__IO uint32_t dst[], __IO const uint32_t src[], size_t n)
{
  /* For each element in the array */
  for (uint32_t index = 0UL; index < n; index++)
  {
    /* Copy the content */
    dst[index] = src[index];
  }
}

/**
  * @brief  Copy uint8_t array to uint64_t array to fit number representation
  * @param  dst Pointer to destination
  * @param  src Pointer to source
  * @retval None.
  */
static void CCB_Memcpy_u8_to_u64(__IO uint32_t dst[], const uint8_t src[])
{
  if ((dst != NULL) && (src != NULL))
  {
    /* Apply the equivalent of __REV from uint8_t to uint32_t */
    dst[0] = ((uint32_t)src[0]) | ((uint32_t)src[-1] << 8UL) | ((uint32_t)src[-2] << 16UL)
             | ((uint32_t)src[-3] << 24UL);
    dst[1] = ((uint32_t)src[-4]) | ((uint32_t)src[-5] << 8UL) | ((uint32_t)src[-6] << 16UL)
             | ((uint32_t)src[-7] << 24UL);
  }
}

/**
  * @brief  Copy uint8_t array to uint64_t array to fit number representation
  * @param  dst Pointer to destination
  * @param  src Pointer to source
  * @param  size Pointer to number of uint8_t to copy
  * @retval None.
  */
static void CCB_Memcpy_Not_Align(__IO uint32_t dst[], const uint8_t src[], size_t size)
{
  /* Manage the buffers not aligned on uint32_t */
  if ((size % 8UL) == 1UL)
  {
    dst[0] = ((uint32_t)src[0]);
    dst[1] = 0;
  }
  else if ((size % 8UL) == 2UL)
  {
    dst[0] = ((uint32_t)src[0]) | ((uint32_t)src[-1] << 8UL);;
    dst[1] = 0UL;
  }
  else if ((size % 8UL) == 3UL)
  {
    dst[0] = ((uint32_t)src[0]) | ((uint32_t)src[-1] << 8UL) | ((uint32_t)src[-2] << 16UL);
    dst[1] = 0UL;
  }

  else if ((size % 8UL) == 4UL)
  {
    dst[0] = ((uint32_t)src[0]) | ((uint32_t)src[-1] << 8UL) | ((uint32_t)src[-2] << 16UL)
             | ((uint32_t)src[-3] << 24UL);
    dst[1] = 0UL;
  }

  else if ((size % 8UL) == 5UL)
  {
    dst[0] = ((uint32_t)src[0]) | ((uint32_t)src[-1] << 8UL) | ((uint32_t)src[-2] << 16UL)
             | ((uint32_t)src[-3] << 24UL);
    dst[1] = ((uint32_t)src[-4]);
  }
  else if ((size % 8UL) == 6UL)
  {
    dst[0] = ((uint32_t)src[0]) | ((uint32_t)src[-1] << 8UL) | ((uint32_t)src[-2] << 16UL)
             | ((uint32_t)src[-3] << 24UL);
    dst[1] = ((uint32_t)src[-4]) | ((uint32_t)src[-5] << 8UL);
  }
  else if ((size % 8UL) == 7UL)
  {
    dst[0] = ((uint32_t)src[0]) | ((uint32_t)src[-1] << 8UL) | ((uint32_t)src[-2] << 16UL)
             | ((uint32_t)src[-3] << 24UL);
    dst[1] = ((uint32_t)src[-4]) | ((uint32_t)src[-5] << 8UL) | ((uint32_t)src[-6] << 16UL);
  }
  else
  {
    /* The last element is already handle in the loop */
  }

}

/**
  * @brief  Get cipher key size
  * @param  pCurveParam pointer to Curve Parameters
  * @retval cipher key size.
  */
static uint32_t  CCB_get_cipherkey_size(CCB_ECDSACurveParamTypeDef *pCurveParam)
{
  uint32_t operand_size = 2U * ((((pCurveParam->modulusSizeByte) + 7U) / 8U) + 1U);

  if ((operand_size % 4U) != 0U)
  {
    return (operand_size - 2U);
  }
  else
  {
    return operand_size;
  }

}

/**
  * @brief  Wrap Symmetric Key.
  * @param  hccb CCB handle.
  * @param  pClearAESKey pointer to the clear AES Key.
  * @param  operation operation.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @retval HAL status.
  */
static HAL_StatusTypeDef CCB_WrapSymmetricKey(CCB_HandleTypeDef *hccb, const uint32_t *pClearAESKey, uint32_t operation,
                                              CCB_WrappingKeyTypeDef *pWrappingKey)
{

  uint32_t i;
  uint32_t cryp_in_count = 0UL;
  uint32_t cryp_out_count = 0UL;
  const uint32_t *pcryp_in_buff = pClearAESKey;
  uint32_t *pcryp_out_buff = pWrappingKey->pUserWrappedWrappingKey;

  if (hccb->State == HAL_CCB_STATE_READY)
  {

    /* Set Operation in CCB */
    MODIFY_REG(CCB->CR, CCB_CR_CCOP, operation);

    /* Wait until OPSTEP is set to 0x01 */
    if (CCB_WaitOperStep(hccb, 0x01, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Initialize RNG */
    if (CCB_RNG_Init(hccb) != HAL_OK)
    {
      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

    /*  Initialize SAES */
    if (Protect_SAES_WaitFLAG(hccb, AES_SR_BUSY, RESET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
#if (defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX))
      /*Check if there is an RNG seed error */
      if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
      {
        /* Attempt to recover from the seed error */
        if (CCB_RNG_ResilientRecoverSeedError(hccb) != HAL_OK)
        {
          /* Disable the SAES peripheral */
          HAL_CCB_GET_SAES_INSTANCE(hccb)->CR &=  ~AES_CR_EN;

          /* Set state and return error */
          hccb->State = HAL_CCB_STATE_ERROR;
          return HAL_ERROR;
        }
      }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
    }

