zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
    /* Update the state */
    hccb->State = HAL_CCB_STATE_BUSY;

    if (pWrappingKey->AES_Algorithm != CCB_AES_ECB)
    {
      WRITE_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->CR, AES_CR_KEYSEL_0 | AES_CR_KMOD_0 \
                | AES_CR_KEYSIZE | AES_CR_CHMOD_0);
    }

    else
    {
      WRITE_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->CR, AES_CR_KEYSEL_0 | AES_CR_KMOD_0 \
                | AES_CR_KEYSIZE);
    }

    /* Wait for Key valid to be set */
    if (Protect_SAES_WaitFLAG(hccb, AES_SR_KEYVALID, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_ERROR;
    }

    /* Disable the CRYP peripheral clock */
    HAL_CCB_GET_SAES_INSTANCE(hccb)->CR &=  ~AES_CR_EN;

    /* Set the operating mode*/
    MODIFY_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->CR, AES_CR_KMOD, AES_CR_KMOD_0);

    /* Encryption operating mode(Mode 0)*/
    MODIFY_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->CR, AES_CR_MODE, 0x0UL); /*!< Encryption mode   */

    if (pWrappingKey->AES_Algorithm != CCB_AES_ECB)
    {
      /* Set the Initialization Vector */
      HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR3 = *(uint32_t *)(pWrappingKey->pInitVect);
      HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR2 = *(uint32_t *)(pWrappingKey->pInitVect + 1U);
      HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR1 = *(uint32_t *)(pWrappingKey->pInitVect + 2U);
      HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR0 = *(uint32_t *)(pWrappingKey->pInitVect + 3U);
    }

    /* Enable CRYP */
    HAL_CCB_GET_SAES_INSTANCE(hccb)->CR |= AES_CR_EN;

    while (cryp_in_count < CCB_SIZE_SKEY_INWORD)
    {
      for (i = 0UL; i < 4UL; i++)
      {
        HAL_CCB_GET_SAES_INSTANCE(hccb)->DINR  = pcryp_in_buff[cryp_in_count];
        cryp_in_count++;
      }

      /* Wait for CCF flag to be raised */
      if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return HAL_ERROR;
      }

      /* Clear CCF Flag */
      SET_BIT(HAL_CCB_GET_SAES_INSTANCE(hccb)->ICR, AES_ICR_CCF);

      /* Read the output block from the output FIFO and put them in temporary buffer then
      get CrypOutBuff from temporary buffer */
      for (i = 0UL; i < 4UL; i++)
      {
        pcryp_out_buff[cryp_out_count] = HAL_CCB_GET_SAES_INSTANCE(hccb)->DOUTR;
        cryp_out_count++;
      }
    }
  }
  else
  {
    /* Set state, error code and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    hccb->ErrorCode = HAL_CCB_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* CCB IPRST set */
  SET_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* CCB is busy while CCB IPRST is in progress */
  if (CCB_WaitFLAG(hccb, CCB_SR_BUSY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_TIMEOUT;
  }

  /* clear CCB IPRST */
  CLEAR_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* Update the CCB state */
  hccb->State = HAL_CCB_STATE_READY;

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Initial phase processing when blob creation
  * @param  hccb CCB handle
  * @param  pIV pointer to the initil vector
  * @retval HAL status
  */
static HAL_StatusTypeDef CCB_BlobCreation_InitialPhase(CCB_HandleTypeDef *hccb, uint32_t *pIV)
{
  /* Load IVs from RNG to SAES */
  HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR0 = CCB_IV0_VALUE;  /* SAES_IVR0 that must be equal to 0x2 */
  if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* For IV1, IV2 and IV3, random generated values are loaded from RNG to SAES by CCB */
  HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR1 = CCB_FAKE_VALUE;
  if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR2 = CCB_FAKE_VALUE;
  if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR3 = CCB_FAKE_VALUE;
  if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* if an error occurs, RNGERRF flag is set in PKA */
  if (HAL_CCB_GET_PKA_FLAG(hccb, PKA_SR_RNGERRF) == SET)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  else
  {
    /* Read back IVs from SAES */
    pIV[3] = HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR3;
    pIV[2] = HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR2;
    pIV[1] = HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR1;
    pIV[0] = HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR0;
  }

  /* Set EN in SAES_CR*/
  HAL_CCB_GET_SAES_INSTANCE(hccb)->CR |= AES_CR_EN;

  /* Wait until CCF is SET in SAES_ISR (end of GCM init) */
  if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Set SAES GCMPH Header phase and trig OPSTEP transition 0x2 --> 0x3 */
  MODIFY_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->CR, AES_CR_GCMPH, AES_CR_GCMPH_0 | AES_CR_EN);

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Initial phase processing when blob use
  * @param  hccb CCB handle
  * @param  pIV pointer to the initil vector
  * @param  pTag pointer to the Tag
  * @retval HAL status
  */
static HAL_StatusTypeDef CCB_BlobUse_InitialPhase(CCB_HandleTypeDef *hccb, const uint32_t *pIV, uint32_t *pTag)
{
  uint16_t count;

  /* Set IVs from created Blob */
  HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR0 = pIV[0];
  HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR1 = pIV[1];
  HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR2 = pIV[2];
  HAL_CCB_GET_SAES_INSTANCE(hccb)->IVR3 = pIV[3];

  /* Set EN in SAES_CR*/
  HAL_CCB_GET_SAES_INSTANCE(hccb)->CR |= AES_CR_EN;

  /* Wait until CCF is SET in SAES_ISR (end of GCM init) */
  if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Write reference tag in CCB */
  for (count = 0; count < CCB_BLOCK_SIZE; count++)
  {
    WRITE_REG(hccb->Instance->REFTAGR[count], pTag[count]);
  }

  /* Set SAES GCMPH Header phase and trig OPSTEP transition 0x12 --> 0x13 */
  MODIFY_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->CR, AES_CR_GCMPH | AES_CR_EN,
             AES_CR_GCMPH_0 | AES_CR_EN);

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Final phase processing when blob creation
  * @param  hccb CCB handle
  * @param  Operation Operation
  * @param  pTag pointer to the Tag
  * @param  sizeparam size of parameters
  * @retval HAL status
  */
static HAL_StatusTypeDef CCB_BlobCreation_FinalPhase(CCB_HandleTypeDef *hccb, uint32_t Operation, uint32_t *pTag,
                                                     uint32_t sizeparam)
{
  uint32_t last_block[4] = {0};
  uint16_t count;
  uint32_t operand_size;
  uint32_t cipherkey_size;

  /* set operand size in 32bits */
  operand_size   = 2UL * ((uint32_t)(((sizeparam) + 7UL) / 8UL) + 1UL);
  if ((operand_size % 4UL) != 0UL)
  {
    cipherkey_size = operand_size - 2UL;
  }
  else
  {
    cipherkey_size = operand_size;
  }
  /* Clear the CMF flag and the chaining mode status bits in 8 to 15 in PKA_SR */
  HAL_CCB_CLEAR_PKA_FLAG(hccb, PKA_CLRFR_CMFC);

