zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
      /* Read ciphered private Key d */
      for (count = 0U; count < CCB_BLOCK_SIZE; count++)
      {
        pWarappedKey[cipherkey_size - (countBlock + count + 1UL)]
          = READ_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->DOUTR);
      }
      countBlock += 4UL;
    }
  }

  /* Wait for Galois Filter End of Computation */
  if (Protect_SAES_WaitFLAG(hccb, AES_SR_BUSY, RESET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
#if (defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX))
    /*Check if there is an RNG seed error */
    if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
    {
      /* Attempt to recover from the seed error */
      if (CCB_RNG_ResilientRecoverSeedError(hccb) != HAL_OK)
      {
        return HAL_ERROR;
      }
    }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
  }
  if ((operand_size % 4UL) != 0UL)
  {
    RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM, PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D
                  + cipherkey_size);
  }
  /* Wait until DATAOKF flag is SET in PKA and trig OPSTEP transition 0x08 --> 0x09 */
  if (Protect_PKA_WaitFLAG(hccb, PKA_SR_DATAOKF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }
#if   defined (HW_SANITY_CHECK_SUPPORT)
  /* Wait until OPSTEP is set to 0x9 */
  if (CCB_WaitOperStep(hccb, 0x09, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }
  /* Write random k */
  for (offset = 0U; offset < (operand_size - 2U); offset++)
  {
    if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }
    HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_K + offset] = CCB_MAGIC_VALUE;
  }
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM, PKA_ECDSA_SIGN_IN_K + offset);
  /* Wait for PKA RNGOK flag : GCMPH = 0x3 (final phase) as events that trig OPSTEP transition 0x09 --> 0x0A */
  if (Protect_PKA_WaitFLAG(hccb, PKA_SR_RNGOKF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

#endif /* GENERATOR_HW_SANITY_CHECK_AVAILABLE_ALL_DEVICES */
  /* Set SAES GCMPH final phase */
  MODIFY_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->CR, AES_CR_GCMPH,
             AES_CR_GCMPH_0 | AES_CR_GCMPH_1);

  /* Wait until OPSTEP is set to 0x0A */
  if (CCB_WaitOperStep(hccb, 0x0A, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Final phase processing */
  if (CCB_BlobCreation_FinalPhase(hccb, CCB_Operation, pTag,
                                  pCurveParam->modulusSizeByte) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

#if   defined (HW_SANITY_CHECK_SUPPORT)
  /* SET PKA START operation bit and trig OPSTEP transition 0x0A --> 0x19 */
  SET_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_START);
  /* Wait until OPSTEP is set to 0x19 */
  if (CCB_WaitOperStep(hccb, 0x19, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }
  /* Wait until end of operation flag is SET in PKA and trig OPSTEP transition 0x19 --> 0x1A */
  if (Protect_PKA_WaitFLAG(hccb, PKA_SR_PROCENDF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }
  /* Wait until OPSTEP is set to 0x1A */
  if (CCB_WaitOperStep(hccb, 0x1A, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }
  /* Check PKA Operation error result */
  if ((HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_OUT_ERROR]) !=  CCB_PKA_ERROR_OPERATION_NONE)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }
  /* Read r part signature */
  CCB_Memcpy_u32_to_u8(pSignature->pRSign, &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_OUT_SIGNATURE_R],
                       pCurveParam->modulusSizeByte);
  /* Read s part signature */
  CCB_Memcpy_u32_to_u8(pSignature->pSSign, &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_OUT_SIGNATURE_S],
                       pCurveParam->modulusSizeByte);

#else
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pSignature);

#endif /* GENERATOR_HW_SANITY_CHECK_AVAILABLE_ALL_DEVICES */
  /* CCB IPRST set */
  SET_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* CCB is busy while CCB IPRST is in progress */
  if (CCB_WaitFLAG(hccb, CCB_SR_BUSY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return timeout*/
    return HAL_TIMEOUT;
  }

  /* clear CCB IPRST */
  CLEAR_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* Update the CCB state */
  hccb->State = HAL_CCB_STATE_READY;

  /* Return HAL OK */
  return HAL_OK;
}


/**
  * @brief  Blob Creation: ECC generate (by RNG) and wrap the private Key (no user input).
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pClearPrivateKey pointer to the related wrapped Private Key Blob.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pIV pointer to the IV.
  * @param  pTag pointer to the Tag.
  * @param  pWarappedKey pointer to the Warapped Key.
  * @param  PublicKey is table of two coordinates X and Y of the publicKey.
  * @param  CCB_Operation is the CCB Operations.
  * @retval HAL status.
  */
static HAL_StatusTypeDef CCB_ECC_ScalarMulBlobCreation(CCB_HandleTypeDef *hccb,
                                                       CCB_ECCMulCurveParamTypeDef *pCurveParam,
                                                       const uint8_t *pClearPrivateKey,
                                                       CCB_WrappingKeyTypeDef *pWrappingKey,
                                                       uint32_t *pIV, uint32_t *pTag, uint32_t *pWarappedKey,
                                                       uint32_t PublicKey[2U][20U], uint8_t CCB_Operation)
{
  uint16_t count;
  uint32_t countBlock = 0UL;
  uint32_t offset;
  uint32_t operand_size;
  uint32_t cipherkey_size;

  if (hccb->State == HAL_CCB_STATE_READY)
  {
    /* Set Operation in CCB */
    MODIFY_REG(CCB->CR, CCB_CR_CCOP, CCB_Operation);

    /* Wait until OPSTEP is set to 0x01 */
    if (CCB_WaitOperStep(hccb, 0x01, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Initialize RNG */
    if (CCB_RNG_Init(hccb) != HAL_OK)
    {
      /* return state and error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

    /* Initialize PKA */
    if (Protect_PKA_Init(hccb, CCB_Operation) != HAL_OK)
    {
      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

