zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
        /* Read ciphered scalar k */
        for (count = 0U; count < CCB_BLOCK_SIZE; count++)
        {
          pWarappedKey[cipherkey_size - (countBlock + count + 1U)]
            = READ_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->DOUTR);
        }
        countBlock += 4UL;
      }
    }

    /* Wait for Galois Filter End of Computation */
    if (Protect_SAES_WaitFLAG(hccb, AES_SR_BUSY, RESET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
#if (defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX))
      /*Check if there is an RNG seed error */
      if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
      {
        /* Attempt to recover from the seed error */
        if (CCB_RNG_ResilientRecoverSeedError(hccb) != HAL_OK)
        {
          return HAL_ERROR;
        }
      }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
    }

    if ((operand_size % 4UL) != 0UL)
    {
      RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM, PKA_ECC_SCALAR_MUL_IN_K
                    + cipherkey_size);
    }

    /* Wait until DATAOKF flag is SET in PKA and trig OPSTEP transition 0x8 --> 0xA */
    if (Protect_PKA_WaitFLAG(hccb, PKA_SR_DATAOKF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Set SAES GCMPH final phase */
    MODIFY_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->CR, AES_CR_GCMPH,
               AES_CR_GCMPH_0 | AES_CR_GCMPH_1);

    /* Wait until OPSTEP is set to 0x0A */
    if (CCB_WaitOperStep(hccb, 0x0A, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Final phase processing */
    if (CCB_BlobCreation_FinalPhase(hccb, CCB_Operation, pTag,
                                    pCurveParam->modulusSizeByte) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

#if   defined (HW_SANITY_CHECK_SUPPORT)
    /* SET PKA START operation bit and trig OPSTEP transition 0x0A --> 0x19 */
    SET_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_START);
    /* Wait until OPSTEP is set to 0x19 */
    if (CCB_WaitOperStep(hccb, 0x19, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }
    /* Wait until end of operation flag is SET in PKA and trig OPSTEP transition 0x19 --> 0x1A */
    if (Protect_PKA_WaitFLAG(hccb, PKA_SR_PROCENDF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }
    /* Wait until OPSTEP is set to 0x1A */
    if (CCB_WaitOperStep(hccb, 0x1A, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }
    /* Check PKA Operation error result */
    if ((HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_ERROR]) !=  CCB_PKA_ERROR_OPERATION_NONE)
    {
      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }
    /* Move the result from appropriate location */
    CCB_Memcpy_u32_to_u32(PublicKey[0], &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_X],
                          ((pCurveParam->modulusSizeByte + 3) / 4));
    CCB_Memcpy_u32_to_u32(PublicKey[1], &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_Y],
                          ((pCurveParam->modulusSizeByte + 3) / 4));

#else
    /* Prevent unused argument(s) compilation warning */
    UNUSED(PublicKey);

#endif /* GENERATOR_HW_SANITY_CHECK_AVAILABLE_ALL_DEVICES */
    /* CCB IPRST set */
    SET_BIT(hccb->Instance->CR, CCB_CR_IPRST);

    /* CCB is busy while CCB IPRST is in progress */
    if (CCB_WaitFLAG(hccb, CCB_SR_BUSY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }

    /* clear CCB IPRST */
    CLEAR_BIT(hccb->Instance->CR, CCB_CR_IPRST);

    /* Update the CCB state */
    hccb->State = HAL_CCB_STATE_READY;
  }

  else
  {
    /* Set state, error code and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    hccb->ErrorCode = HAL_CCB_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Blob Usage: ECC Compute Scalar Multiplication.
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pIV pointer to the IV.
  * @param  pTag pointer to the Tag.
  * @param  pWarappedKey pointer to the Warapped Key.
  * @param  pInputPoint pointer to the input point structure.
  * @param  pOutputPoint pointer to the output point.
  * @param  pPublicKey pointer to the input public key for check.
  * @param  VerifOperation allows to compare the OutputPoint with the Publickey.
  * @retval HAL status.
  */
static HAL_StatusTypeDef CCB_ECC_ComputeScalarMul(CCB_HandleTypeDef *hccb, CCB_ECCMulCurveParamTypeDef *pCurveParam,
                                                  CCB_WrappingKeyTypeDef *pWrappingKey,
                                                  uint32_t *pIV, uint32_t *pTag, uint32_t *pWarappedKey,
                                                  CCB_ECCMulPointTypeDef *pInputPoint,
                                                  CCB_ECCMulPointTypeDef *pOutputPoint,
                                                  const uint32_t *pPublicKey,
                                                  uint8_t VerifOperation)
{
  __IO uint16_t f_count;
  uint16_t random1 = 0;
  uint16_t random2 = 0;
  uint16_t random3 = 0;
  uint16_t count_ram;
  uint32_t count_block = 0UL;
  uint32_t offset;
  uint32_t operand_size;
  uint32_t cipherkey_size;
  uint32_t tickstart;

  /* Set Operation in CCB */
  MODIFY_REG(CCB->CR, CCB_CR_CCOP, CCB_ECC_SCALAR_MUL_BLOB_USE);

  /* Wait until OPSTEP is set to 0x01 */
  if (CCB_WaitOperStep(hccb, 0x01, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Initialize RNG */
  if (CCB_RNG_Init(hccb) != HAL_OK)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  tickstart = HAL_GetTick();

  while (random1 == 0U)
  {
    random1 = (uint16_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0x3FFU);
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Set state and return error */
      return HAL_ERROR;
    }
  }

  if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  tickstart = HAL_GetTick();

  while (random2 == 0U)
  {
    random2 = (uint16_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0x3FFU);
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Set state and return error */
      return HAL_ERROR;
    }
  }

  if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  tickstart = HAL_GetTick();

