zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
  while (random3 == 0U)
  {
    random3 = (uint16_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0x3FFU);
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Set state and return error */
      return HAL_ERROR;
    }
  }

  /* Initialize PKA */
  if (Protect_PKA_Init(hccb, CCB_ECC_SCALAR_MUL_BLOB_USE) != HAL_OK)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }


  if (VerifOperation == CCB_VERIF_OPERATION_DISABLED)
  {
    /* Write Customized point coordinate */
    CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X ],
                         pInputPoint->pPointX, pCurveParam->modulusSizeByte);
    RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                  PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));
    CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y ],
                         pInputPoint->pPointY, pCurveParam->modulusSizeByte);
    RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                  PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));
  }
  else if (VerifOperation == CCB_VERIF_OPERATION_ENABLED)
  {
    /* Write  point G coordinate */
    CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X ],
                         pCurveParam->pPointX, pCurveParam->modulusSizeByte);
    RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                  PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));
    CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y ],
                         pCurveParam->pPointY, pCurveParam->modulusSizeByte);
    RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                  PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));
  }
  else
  {
    /* nothing to do */
  }

  /*  Initialize SAES */
  if (Protect_SAES_WaitFLAG(hccb, AES_SR_BUSY, RESET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
#if (defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX))
    /*Check if there is an RNG seed error */
    if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
    {
      /* Attempt to recover from the seed error */
      if (CCB_RNG_ResilientRecoverSeedError(hccb) != HAL_OK)
      {
        /* Disable the SAES peripheral */
        HAL_CCB_GET_SAES_INSTANCE(hccb)->CR &=  ~AES_CR_EN;

        /* Set state and return error */
        hccb->State = HAL_CCB_STATE_ERROR;
        return HAL_ERROR;
      }
    }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
  }

  /* Update the state */
  hccb->State = HAL_CCB_STATE_BUSY;

  /* Wrapping Key configuration */
  if (WrappingKeyConfiguration(hccb, CCB_ECC_SCALAR_MUL_BLOB_USE, pWrappingKey) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x012 */
  if (CCB_WaitOperStep(hccb, 0x012, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Update the state */
  hccb->State = HAL_CCB_STATE_BUSY;

  /* set 32bits word number and operand size*/

  operand_size   = 2UL * ((uint32_t)(((pCurveParam->primeOrderSizeByte) + 7UL) / 8UL) + 1UL);

  if ((operand_size % 4UL) != 0UL)
  {
    cipherkey_size = operand_size - 2UL;
  }
  else
  {
    cipherkey_size = operand_size;
  }

  /* Initial Phase Processing */
  if (CCB_BlobUse_InitialPhase(hccb, pIV, pTag) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x13 */
  if (CCB_WaitOperStep(hccb, 0x13, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }
  if (VerifOperation == CCB_COMPUTE_PUBLIC_KEY)
  {
    /* Set parameters */
    if (CCB_ECDSASign_SetPram(hccb, pCurveParam) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }
  }
  else
  {
    /* Set parameters */
    if (CCB_ECCMul_SetPram(hccb, pCurveParam) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }
  }

  /* Set SAES GCMPH Payload phase and trig OPSTEP that trig OPSTEP transition 0x13 --> 0x14 */
  MODIFY_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->CR, AES_CR_GCMPH, AES_CR_GCMPH_1);

  /* Wait until OPSTEP is set to 0x14 */
  if (CCB_WaitOperStep(hccb, 0x14, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  for (offset = 0UL; offset < cipherkey_size; offset++)
  {
    /* Write Wrapped scalar k in PKA RAM */
    WRITE_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->DINR, pWarappedKey[cipherkey_size - (offset + 1UL)]);

    if ((offset % 4UL) == 0x3UL)
    {
      /* Wait until CCF flag is SET in SAES */
      if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        /* return error */
        return HAL_ERROR;
      }

      /* Write Unrapped scalar k in PKA RAM */
      for (count_ram = 0U; count_ram < 4U; count_ram++)
      {
        HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_K + (count_block + count_ram)] = CCB_MAGIC_VALUE;
      }
      count_block += 4UL;
    }
  }
  if ((operand_size % 4UL) != 0UL)
  {
    RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM, PKA_ECDSA_SIGN_IN_K
                  + cipherkey_size);
  }

  /* Wait until OPSTEP is set to 0x17 */
  if (CCB_WaitOperStep(hccb, 0x17, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }
  if (VerifOperation == CCB_COMPUTE_PUBLIC_KEY)
  {
    /* Final phase processing */
    if (CCB_BlobUse_FinalPhase(hccb, CCB_ECDSA_SIGN_BLOB_USE, pCurveParam->modulusSizeByte) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }
  }
  else
  {
    /* Final phase processing */
    if (CCB_BlobUse_FinalPhase(hccb, CCB_ECC_SCALAR_MUL_BLOB_USE, pCurveParam->modulusSizeByte) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }
  }

