zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
  /* Wait until OPSTEP is set to 0x18 */
  if (CCB_WaitOperStep(hccb, 0x18, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* SET PKA START operation bit and trig OPSTEP transition 0x18 --> 0x19 */
  SET_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_START);

  /* Wait until OPSTEP is set to 0x19 */
  if (CCB_WaitOperStep(hccb, 0x19, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until end of operation flag is SET in PKA and trig OPSTEP transition 0x19 --> 0x1A */
  if (Protect_PKA_WaitFLAG(hccb, PKA_SR_PROCENDF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x1A */
  if (CCB_WaitOperStep(hccb, 0x1A, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Check PKA Operation error result */
  if ((HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_ERROR]) !=  CCB_PKA_ERROR_OPERATION_NONE)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  if (VerifOperation == CCB_VERIF_OPERATION_DISABLED)
  {
    /* P coordinate x */
    CCB_Memcpy_u32_to_u8(pOutputPoint->pPointX,
                         &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_X],
                         pCurveParam->modulusSizeByte);

    /* P coordinate y */
    CCB_Memcpy_u32_to_u8(pOutputPoint->pPointY,
                         &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_Y],
                         pCurveParam->modulusSizeByte);
  }
  else if (VerifOperation == CCB_COMPUTE_PUBLIC_KEY)
  {
    /* P coordinate x */
    CCB_Memcpy_u32_to_u8(pOutputPoint->pPointX,
                         &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_X],
                         pCurveParam->modulusSizeByte);

    /* P coordinate y */
    CCB_Memcpy_u32_to_u8(pOutputPoint->pPointY,
                         &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_Y],
                         pCurveParam->modulusSizeByte);
  }
  else /* (VerifOperation == CCB_VERIF_OPERATION_ENABLED) */
  {
    f_count = 0;
    while (f_count < random1)
    {
      f_count++;
    }

    /* P coordinate x */
    for (offset = 0UL; offset < ((pCurveParam->modulusSizeByte + 3UL) / 4UL); offset++)
    {
      /* Check  public key coordinate x and improve robustness against intrusion (intentional) */
      if (((HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_X + offset] != pPublicKey[offset]) ||
           (f_count != random1) || (f_count == 0U)))
      {
        /* Set state, and intrusion error */
        hccb->State = HAL_CCB_STATE_ERROR;
        HAL_CCB_IntrusionCallback(hccb);
      }
    }

    /* P coordinate y */

    for (offset = 0UL; offset < ((pCurveParam->modulusSizeByte + 3UL) / 4UL); offset++)
    {
      /* Check  public key coordinate y and improve robustness against intrusion (intentional) */
      if (((HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_Y + offset]
            != pPublicKey[offset + 20U]) || (f_count != random1) || (f_count == 0U)))
      {
        /* Set state, and intrusion error */
        hccb->State = HAL_CCB_STATE_ERROR;
        HAL_CCB_IntrusionCallback(hccb);
      }
    }

    f_count = 0;
    while (f_count < random2)
    {
      f_count++;
    }

    /* P coordinate x */
    for (offset = 0UL; offset < ((pCurveParam->modulusSizeByte + 3UL) / 4UL); offset++)
    {
      /* Check  public key coordinate x and improve robustness against intrusion (intentional) */
      if (((HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_X + offset] != pPublicKey[offset]) ||
           (f_count != random2) || (f_count == 0U)))
      {
        /* Set state, and intrusion error */
        hccb->State = HAL_CCB_STATE_ERROR;
        HAL_CCB_IntrusionCallback(hccb);
      }
    }

    /* P coordinate y */

    for (offset = 0UL; offset < ((pCurveParam->modulusSizeByte + 3UL) / 4UL); offset++)
    {
      /* Check  public key coordinate y and improve robustness against intrusion (intentional) */
      if (((HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_Y + offset] !=
            pPublicKey[offset + 20U]) || (f_count != random2) || (f_count == 0U)))
      {
        /* Set state, and intrusion error */
        hccb->State = HAL_CCB_STATE_ERROR;
        HAL_CCB_IntrusionCallback(hccb);
      }
    }

    f_count = 0;
    while (f_count < random3)
    {
      f_count++;
    }

    /* P coordinate x */
    for (offset = 0UL; offset < ((pCurveParam->modulusSizeByte + 3UL) / 4UL); offset++)
    {
      /* Check  public key coordinate x and improve robustness against intrusion (intentional) */
      if (((HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_X + offset] != pPublicKey[offset]) ||
           (f_count != random3) || (f_count == 0U)))
      {
        /* Set state, and intrusion error */
        hccb->State = HAL_CCB_STATE_ERROR;
        HAL_CCB_IntrusionCallback(hccb);
      }
    }

    /* P coordinate y */

    for (offset = 0UL; offset < ((pCurveParam->modulusSizeByte + 3UL) / 4UL); offset++)
    {
      /* Check  public key coordinate y and improve robustness against intrusion (intentional) */
      if (((HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_Y + offset] !=
            pPublicKey[offset + 20U]) || (f_count != random3) || (f_count == 0U)))
      {
        /* Set state, and intrusion error */
        hccb->State = HAL_CCB_STATE_ERROR;
        HAL_CCB_IntrusionCallback(hccb);
      }
    }
  }

  /* CCB IPRST set */
  SET_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* CCB is busy while CCB IPRST is in progress */
  if (CCB_WaitFLAG(hccb, CCB_SR_BUSY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_TIMEOUT;
  }

  /* clear CCB IPRST */
  CLEAR_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* Update the CCB state */
  hccb->State = HAL_CCB_STATE_READY;

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Blob Creation: RSA Wrap the private Key (input from user).
  * @param  hccb CCB handle.
  * @param  pParam pointer to the modular exponatiation parameters.
  * @param  pRSAClearPrivateKey pointer to the clear Private Key.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pIV pointer to the IV.
  * @param  pTag pointer to the Tag.
  * @param  pWrappedExp pointer to the Warapped Exp.
  * @param  pWrappedPhi pointer to the Warapped Phi.
  * @param  pOperand pointer to the constant K as operand A.
  * @param  pReferenceModularExp pointer to the output ReferenceModularExp.
  * @retval HAL status.
  */
static HAL_StatusTypeDef CCB_RSA_ExpBlobCreation(CCB_HandleTypeDef *hccb, CCB_RSAParamTypeDef *pParam,
                                                 const CCB_RSAClearKeyTypeDef *pRSAClearPrivateKey,
                                                 CCB_WrappingKeyTypeDef *pWrappingKey, uint32_t *pIV,
                                                 uint32_t *pTag, uint32_t *pWrappedExp, uint32_t *pWrappedPhi,
                                                 uint8_t *pOperand, uint32_t *pReferenceModularExp)
{
  uint16_t count;
  uint32_t countBlock = 0UL;
  uint32_t offset;
  uint32_t operand_size;
  uint32_t cipherkey_size;

  /* Set Operation in CCB */
  MODIFY_REG(CCB->CR, CCB_CR_CCOP, CCB_MODULAR_EXP_CPU_BLOB_CREATION);

  /* Wait until OPSTEP is set to 0x01 */
  if (CCB_WaitOperStep(hccb, 0x01, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Initialize RNG */
  if (CCB_RNG_Init(hccb) != HAL_OK)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  /* Initialize PKA */
  if (Protect_PKA_Init(hccb, CCB_MODULAR_EXP_CPU_BLOB_CREATION) != HAL_OK)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

