zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
  /* Wait until OPSTEP is set to 0x08 */
  if (CCB_WaitOperStep(hccb, 0x08, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Clear the CMF flag and the chaining mode status bits in 8 to 15 in PKA_SR */
  HAL_CCB_CLEAR_PKA_FLAG(hccb, PKA_CLRFR_CMFC);

  /* Read clear exponent e for encryption  */
  for (offset = 0UL; offset < cipherkey_size; offset++)
  {

    HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_PROTECT_IN_EXPONENT + offset] = CCB_MAGIC_VALUE;

    if ((offset % 4UL) == 3UL)
    {
      /* Wait until CCF flag is SET in SAES*/
      if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        /* return error */
        return HAL_ERROR;
      }

      /* Read ciphered exponent e */
      for (count = 0U; count < CCB_BLOCK_SIZE; count++)
      {
        pWrappedExp[cipherkey_size - (countBlock + count + 1UL)]
          = READ_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->DOUTR);
      }
      countBlock += 4UL;
    }
  }

  /* Wait for Galois Filter End of Computation */
  if (Protect_SAES_WaitFLAG(hccb, AES_SR_BUSY, RESET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
#if (defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX))
    /*Check if there is an RNG seed error */
    if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
    {
      /* Attempt to recover from the seed error */
      if (CCB_RNG_ResilientRecoverSeedError(hccb) != HAL_OK)
      {
        return HAL_ERROR;
      }
    }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
  }

  if ((operand_size % 4UL) != 0UL)
  {
    RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM, PKA_MODULAR_EXP_PROTECT_IN_EXPONENT
                  + cipherkey_size);
  }

  /* Wait until DATAOKF flag is SET in PKA and trig OPSTEP transition 0x8 --> 0x9 */
  if (Protect_PKA_WaitFLAG(hccb, PKA_SR_DATAOKF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x09 */
  if (CCB_WaitOperStep(hccb, 0x09, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Clear the CMF flag and the chaining mode status bits in 8 to 15 in PKA_SR */
  HAL_CCB_CLEAR_PKA_FLAG(hccb, PKA_CLRFR_CMFC);

  countBlock = 0U;

  /* Read clear  phi for encryption  */
  for (offset = 0; offset < cipherkey_size; offset++)
  {

    HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_PROTECT_IN_PHI + offset] = CCB_MAGIC_VALUE;

    if ((offset % 4UL) == 3UL)
    {
      /* Wait until CCF flag is SET in SAES*/
      if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        /* return error */
        return HAL_ERROR;
      }

      /* Read ciphered phi */
      for (count = 0U; count < CCB_BLOCK_SIZE; count++)
      {
        pWrappedPhi[cipherkey_size - (countBlock + count + 1UL)]
          = READ_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->DOUTR);
      }
      countBlock += 4UL;
    }
  }

  /* Wait for Galois Filter End of Computation */
  if (Protect_SAES_WaitFLAG(hccb, AES_SR_BUSY, RESET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
#if (defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX))
    /*Check if there is an RNG seed error */
    if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
    {
      /* Attempt to recover from the seed error */
      if (CCB_RNG_ResilientRecoverSeedError(hccb) != HAL_OK)
      {
        return HAL_ERROR;
      }
    }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
  }

  if ((operand_size % 4UL) != 0UL)
  {
    RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM, PKA_MODULAR_EXP_PROTECT_IN_PHI
                  + cipherkey_size);
  }

  /* Wait until DATAOKF flag is SET in PKA and trig OPSTEP transition 0x9 --> 0xA  */
  if (Protect_PKA_WaitFLAG(hccb, PKA_SR_DATAOKF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Set SAES GCMPH final phase */
  MODIFY_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->CR, AES_CR_GCMPH,
             AES_CR_GCMPH_0 | AES_CR_GCMPH_1);

  /* Wait until OPSTEP is set to 0x0A */
  if (CCB_WaitOperStep(hccb, 0x0A, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Final phase processing */
  if (CCB_BlobCreation_FinalPhase(hccb, CCB_MODULAR_EXP_CPU_BLOB_CREATION, pTag,
                                  pParam->modulusSizeByte) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

#if   defined (HW_SANITY_CHECK_SUPPORT)
  /* SET PKA START operation bit and trig OPSTEP transition 0x0A --> 0x19 */
  SET_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_START);
  /* Wait until OPSTEP is set to 0x19 */
  if (CCB_WaitOperStep(hccb, 0x19, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }
  /* Wait until end of operation flag is SET in PKA and trig OPSTEP transition 0x19 --> 0x1A */
  if (Protect_PKA_WaitFLAG(hccb, PKA_SR_PROCENDF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }
  /* Wait until OPSTEP is set to 0x1A */
  if (CCB_WaitOperStep(hccb, 0x1A, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }
  /* Check PKA Operation error result */
  if ((HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_OUT_ERROR]) !=  CCB_PKA_ERROR_OPERATION_NONE)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }
  /* Read result output */
  for (offset = 0U; offset < (pParam->modulusSizeByte + 3) / 4; offset++)
  {
    pReferenceModularExp[offset] = HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_OUT_RESULT + offset];
  }

#else
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pReferenceModularExp);

#endif /* GENERATOR_HW_SANITY_CHECK_AVAILABLE_ALL_DEVICES */
  /* CCB IPRST set */
  SET_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* CCB is busy while CCB IPRST is in progress */
  if (CCB_WaitFLAG(hccb, CCB_SR_BUSY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_TIMEOUT;
  }

