zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
  /* clear CCB IPRST */
  CLEAR_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* Update the CCB state */
  hccb->State = HAL_CCB_STATE_READY;

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Blob Usage: RSA Compute Modular exponentiation.
  * @param  hccb CCB handle.
  * @param  pParam pointer to the modular exponatiation parameters.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pIV pointer to the IV.
  * @param  pTag pointer to the Tag.
  * @param  pWrappedExp pointer to the Warapped Exp.
  * @param  pWrappedPhi pointer to the Warapped Phi.
  * @param  pOperand pointer to the operand.
  * @param  pModularExp pointer to the output operation.
  * @param  pReferenceModularExp pointer to the ReferenceModularExp computed in modular exponentiation Blob creation
  * @param  VerifOperation pointer to the VerifOperation.
  * @retval HAL status.
  */
static HAL_StatusTypeDef CCB_RSA_ComputeModularExp(CCB_HandleTypeDef *hccb, CCB_RSAParamTypeDef *pParam,
                                                   CCB_WrappingKeyTypeDef *pWrappingKey, uint32_t *pIV,
                                                   uint32_t *pTag, uint32_t *pWrappedExp, uint32_t *pWrappedPhi,
                                                   const uint8_t *pOperand, uint8_t *pModularExp,
                                                   const uint32_t *pReferenceModularExp, uint8_t VerifOperation)
{
  __IO uint16_t f_count;
  uint16_t random1 = 0;
  uint16_t random2 = 0;
  uint16_t random3 = 0;
  uint16_t count_ram;
  uint32_t count_block = 0UL;
  uint32_t offset;
  uint32_t operand_size;
  uint32_t cipherkey_size;
  uint32_t tickstart;

  /* Set Operation in CCB */
  MODIFY_REG(CCB->CR, CCB_CR_CCOP, CCB_MODULAR_EXP_BLOB_USE);

  /* Wait until OPSTEP is set to 0x01 */
  if (CCB_WaitOperStep(hccb, 0x01, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Initialize RNG */
  if (CCB_RNG_Init(hccb) != HAL_OK)
  {
    /* Set State and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  tickstart = HAL_GetTick();

  while (random1 == 0U)
  {
    random1 = (uint16_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0x3FFU);
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Set state and return error */
      return HAL_ERROR;
    }
  }

  if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  tickstart = HAL_GetTick();

  while (random2 == 0U)
  {
    random2 = (uint16_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0x3FFU);
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Set state and return error */
      return HAL_ERROR;
    }
  }

  if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  tickstart = HAL_GetTick();

  while (random3 == 0U)
  {
    random3 = (uint16_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0x3FFU);
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Set state and return error */
      return HAL_ERROR;
    }
  }

  /* Initialize PKA */
  if (Protect_PKA_Init(hccb, CCB_MODULAR_EXP_BLOB_USE) != HAL_OK)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  /*  Initialize SAES */
  if (Protect_SAES_WaitFLAG(hccb, AES_SR_BUSY, RESET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
#if (defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX))
    /*Check if there is an RNG seed error */
    if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
    {
      /* Attempt to recover from the seed error */
      if (CCB_RNG_ResilientRecoverSeedError(hccb) != HAL_OK)
      {
        /* Disable the SAES peripheral */
        HAL_CCB_GET_SAES_INSTANCE(hccb)->CR &=  ~AES_CR_EN;

        /* Set state and return error */
        hccb->State = HAL_CCB_STATE_ERROR;
        return HAL_ERROR;
      }
    }
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
  }

  /* Update the state */
  hccb->State = HAL_CCB_STATE_BUSY;

  /* Wrapping Key configuration */
  if (WrappingKeyConfiguration(hccb, CCB_MODULAR_EXP_BLOB_USE, pWrappingKey) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x012 */
  if (CCB_WaitOperStep(hccb, 0x012, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Update the state */
  hccb->State = HAL_CCB_STATE_BUSY;

  /* set 32bits word number of encrypted exponent e and encrypted phi*/
  /* set operand size */

  operand_size   = 2UL * ((uint32_t)(((pParam->modulusSizeByte) + 7UL) / 8UL) + 1UL);
  if ((operand_size % 4UL) != 0UL)
  {
    cipherkey_size = operand_size - 2UL;
  }

  else
  {
    cipherkey_size = operand_size;
  }

  /* Set Operand A - base of exponentiation */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_PROTECT_IN_EXPONENT_BASE ], pOperand,
                       pParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_MODULAR_EXP_PROTECT_IN_EXPONENT_BASE + ((pParam->modulusSizeByte + 3UL)));

  /* Initial Phase Processing */
  if (CCB_BlobUse_InitialPhase(hccb, pIV, pTag) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x13 */
  if (CCB_WaitOperStep(hccb, 0x13, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Set RSA Modular Exponentiation parameters */
  if (CCB_RSAModExp_SetPram(hccb, pParam) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Set SAES GCMPH Payload phase and trig OPSTEP that trig OPSTEP transition 0x13 --> 0x14 */
  MODIFY_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->CR, AES_CR_GCMPH, AES_CR_GCMPH_1);

  /* Wait until OPSTEP is set to 0x14 */
  if (CCB_WaitOperStep(hccb, 0x14, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Write encrypted exponent e in DINR of SAES */
  for (offset = 0UL; offset < cipherkey_size; offset++)
  {
    WRITE_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->DINR, pWrappedExp[cipherkey_size - (offset + 1U)]);

    if ((offset % 4UL) == 0x3UL)
    {
      /* Wait until CCF flag is SET in SAES */
      if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        /* return error */
        return HAL_ERROR;
      }

