zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
      /* Write key in PKA RAM */
      for (count_ram = 0U; count_ram < 4U; count_ram++)
      {
        HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_PROTECT_IN_EXPONENT
                                            + (count_block + count_ram)] = CCB_MAGIC_VALUE;
      }
      count_block += 4UL;
    }
  }

  if ((operand_size % 4UL) != 0UL)
  {
    RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM, PKA_MODULAR_EXP_PROTECT_IN_EXPONENT + cipherkey_size);
  }

  /* Wait until DATAOKF flag is SET in PKA and trig OPSTEP transition 0x14 --> 0x15 */
  if (Protect_PKA_WaitFLAG(hccb, PKA_SR_DATAOKF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  if (CCB_WaitOperStep(hccb, 0x15, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Clear the CMF flag and the chaining mode status bits in 8 to 15 in PKA_SR */
  HAL_CCB_CLEAR_PKA_FLAG(hccb, PKA_CLRFR_CMFC);

  count_block = 0UL;
  /* Write encrypted phi in DINR of SAES */

  for (offset = 0UL; offset < cipherkey_size; offset++)
  {
    WRITE_REG(HAL_CCB_GET_SAES_INSTANCE(hccb)->DINR, pWrappedPhi[cipherkey_size - (offset + 1UL)]);

    if ((offset % 4UL) == 0x3UL)
    {
      /* Wait until CCF flag is SET in SAES */
      if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        /* return error */
        return HAL_ERROR;
      }

      /* Write key in PKA RAM */
      for (count_ram = 0U; count_ram < 4U; count_ram++)
      {
        HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_PROTECT_IN_PHI
                                            + (count_block + count_ram)] = CCB_MAGIC_VALUE;
      }
      count_block += 4UL;
    }
  }

  if ((operand_size % 4UL) != 0UL)
  {
    RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM, PKA_MODULAR_EXP_PROTECT_IN_PHI + cipherkey_size);
  }

  /* Wait until DATAOKF flag is SET in PKA and trig OPSTEP transition 0x15 --> 0x17 */
  if (Protect_PKA_WaitFLAG(hccb, PKA_SR_DATAOKF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x17 */
  if (CCB_WaitOperStep(hccb, 0x17, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Final phase processing */
  if (CCB_BlobUse_FinalPhase(hccb, CCB_MODULAR_EXP_BLOB_USE, pParam->modulusSizeByte) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x18 */
  if (CCB_WaitOperStep(hccb, 0x18, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* SET PKA START operation bit and trig OPSTEP transition 0x18 --> 0x19 */
  SET_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_START);

  /* Wait until OPSTEP is set to 0x19 */
  if (CCB_WaitOperStep(hccb, 0x19, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until end of operation flag is SET in PKA and trig OPSTEP transition 0x19 --> 0x1A */
  if (Protect_PKA_WaitFLAG(hccb, PKA_SR_PROCENDF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x1A */
  if (CCB_WaitOperStep(hccb, 0x1A, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Check PKA Operation error result */
  if ((HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_OUT_ERROR]) !=  CCB_PKA_ERROR_OPERATION_NONE)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  if (VerifOperation == CCB_VERIF_OPERATION_DISABLED)
  {
    /* Read result output */
    CCB_Memcpy_u32_to_u8(pModularExp, &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_OUT_RESULT],
                         pParam->modulusSizeByte);
  }
  else /* CCB_VERIF_OPERATION_ENABLED */
  {
    f_count = 0;
    while (f_count < random1)
    {
      f_count++;
    }

    for (offset = 0UL; offset < ((pParam->modulusSizeByte + 3UL) / 4UL); offset++)
    {
      /* Check Modular Exponentiation and improve robustness against intrusion (intentional) */
      if (((HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_OUT_RESULT + offset] != pReferenceModularExp[offset])
           || (f_count != random1) ||
           (f_count == 0U)))
      {
        /* Set state, and intrusion error */
        hccb->State = HAL_CCB_STATE_ERROR;
        HAL_CCB_IntrusionCallback(hccb);
      }

    }

    f_count = 0;
    while (f_count < random2)
    {
      f_count++;
    }

    for (offset = 0UL; offset < ((pParam->modulusSizeByte + 3UL) / 4UL); offset++)
    {
      /* Check Modular Exponentiation and improve robustness against intrusion (intentional) */
      if (((HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_OUT_RESULT + offset] != pReferenceModularExp[offset])
           || (f_count != random2) ||
           (f_count == 0U)))
      {
        /* Set state, and intrusion error */
        hccb->State = HAL_CCB_STATE_ERROR;
        HAL_CCB_IntrusionCallback(hccb);
      }
    }

    f_count = 0;
    while (f_count < random3)
    {
      f_count++;
    }

    for (offset = 0UL; offset < ((pParam->modulusSizeByte + 3UL) / 4UL); offset++)
    {
      /* Check Modular Exponentiation and improve robustness against intrusion (intentional) */
      if (((HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_OUT_RESULT + offset] != pReferenceModularExp[offset])
           || (f_count != random3) ||
           (f_count == 0U)))
      {
        /* Set state, and intrusion error */
        hccb->State = HAL_CCB_STATE_ERROR;
        HAL_CCB_IntrusionCallback(hccb);
      }
    }
  }

  /* CCB IPRST set */
  SET_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* CCB is busy while CCB IPRST is in progress */
  if (CCB_WaitFLAG(hccb, CCB_SR_BUSY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_TIMEOUT;
  }

  /* clear CCB IPRST */
  CLEAR_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* Update the CCB state */
  hccb->State = HAL_CCB_STATE_READY;

  /* Return HAL OK */
  return HAL_OK;
}

#if  defined(SW_SANITY_CHECK_SUPPORT)
/**
  * @brief  Erase the PKA RAM.
  * @param  hccb CCB handle.
  * @retval HAL status.
  */
static HAL_StatusTypeDef PKA_RAM_Erase(CCB_HandleTypeDef *hccb)
{
  uint32_t index;
  __IO uint8_t random_nbr = 0U;
  uint32_t tickstart;

