zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
  HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[CCB_PKA_RAM_SIZE - 1U] = CCB_MAGIC_VALUE;

  /* For each element in the PKA RAM */
  for (index = 0; index < CCB_PKA_RAM_SIZE; index++)
  {
    if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_ERROR;
    }
    /* Clear the content */
    HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[index] = HAL_CCB_GET_RNG_INSTANCE(hccb)->DR;
  }

  if (HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[CCB_PKA_RAM_SIZE - 1U] == CCB_MAGIC_VALUE)
  {
    if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_ERROR;
    }

    tickstart = HAL_GetTick();

    while (random_nbr == 0U)
    {
      random_nbr = (uint8_t)(HAL_CCB_GET_RNG_INSTANCE(hccb)->DR & 0xFFU);
      if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
      {
        /* Set state and return error */
        return HAL_ERROR;
      }
    }

    while (random_nbr != 0UL)
    {
      random_nbr--;
    }

    /* For each element in the PKA RAM */
    for (index = 0; index < CCB_PKA_RAM_SIZE; index++)
    {
      if (CCB_RNG_Wait_SET_FLAG(hccb, RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return HAL_ERROR;
      }
      /* Clear the content */
      HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[index] = HAL_CCB_GET_RNG_INSTANCE(hccb)->DR;
    }

    if (HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[CCB_PKA_RAM_SIZE - 1U] == CCB_MAGIC_VALUE)
    {
      return HAL_ERROR;
    }
  }

  /* Return HAL OK */
  return HAL_OK;

}

/**
  * @brief  CCB PKA ECDSA Signature.
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pClearPrivateKey pointer to the clear private key.
  * @param  pInteger pointer to the integer k.
  * @param  pHash pointer to the input hash.
  * @param  pSignature Pointer to output signature
  * @retval HAL status.
  */
static HAL_StatusTypeDef PKA_ECDSASign(CCB_HandleTypeDef *hccb, CCB_ECDSACurveParamTypeDef *pCurveParam,
                                       const uint8_t *pClearPrivateKey, uint8_t *pInteger, uint8_t *pHash,
                                       CCB_ECDSASignTypeDef *pSignature)
{
  uint32_t tickstart;
  uint32_t timeout = HAL_CCB_TIMEOUT_DEFAULT_VALUE;

  /* Get the prime order n length */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_ORDER_NB_BITS] \
    = GetOptBitSize_u8(pCurveParam->primeOrderSizeByte, *(pCurveParam->pPrimeOrder));

  /* Get the modulus p length */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_MOD_NB_BITS] \
    = GetOptBitSize_u8(pCurveParam->modulusSizeByte, *(pCurveParam->pModulus));

  /* Get the coefficient a sign */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_A_COEFF_SIGN] = pCurveParam->coefSignA;

  /* Move the input parameters coefficient |a| to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_A_COEFF], pCurveParam->pAbsCoefA,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_SIGN_IN_A_COEFF + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters coefficient B to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_B_COEFF], pCurveParam->pCoefB,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_SIGN_IN_B_COEFF + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters modulus value p to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_MOD_GF], pCurveParam->pModulus,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_SIGN_IN_MOD_GF + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters integer k to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_K], pInteger,
                       pCurveParam->primeOrderSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_SIGN_IN_K + ((pCurveParam->primeOrderSizeByte + 3UL) / 4UL));

  /* Move the input parameters base point G coordinate x to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_INITIAL_POINT_X],
                       pCurveParam->pPointX, pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_SIGN_IN_INITIAL_POINT_X + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters base point G coordinate y to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_INITIAL_POINT_Y],
                       pCurveParam->pPointY, pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_SIGN_IN_INITIAL_POINT_Y + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters hash of message z to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_HASH_E], pHash,
                       pCurveParam->primeOrderSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_SIGN_IN_HASH_E + ((pCurveParam->primeOrderSizeByte + 3UL) / 4UL));

  /* Move the input parameters private key d to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D],
                       pClearPrivateKey, pCurveParam->primeOrderSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D + ((pCurveParam->primeOrderSizeByte + 3UL) / 4UL));

  /* Move the input parameters prime order n to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_IN_ORDER_N],
                       pCurveParam->pPrimeOrder, pCurveParam->primeOrderSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_SIGN_IN_ORDER_N + ((pCurveParam->primeOrderSizeByte + 3UL) / 4UL));

  /* Init tickstart for timeout management*/
  tickstart = HAL_GetTick();

