zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
  /* Set the mode and deactivate the interrupts */
  MODIFY_REG(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR,
             PKA_CR_MODE | PKA_CR_PROCENDIE | PKA_CR_RAMERRIE | PKA_CR_ADDRERRIE | PKA_CR_OPERRIE,
             CCB_PKA_ECDSA_SIGNATURE_MODE << PKA_CR_MODE_Pos);

  /* Start the computation */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->CR |= PKA_CR_START;

  /* Wait for the end of operation or timeout */
  while ((HAL_CCB_GET_PKA_INSTANCE(hccb)->SR & PKA_SR_PROCENDF) == 0UL)
  {
    if (((HAL_GetTick() - tickstart) > timeout) || (timeout == 0UL))
    {
      /* Abort any ongoing operation */
      CLEAR_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_EN);
      /* Make ready for the next operation */
      SET_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_EN);

      return HAL_TIMEOUT;
    }

  }

  /* Clear all flags */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->CLRFR |= (PKA_CLRFR_PROCENDFC | PKA_CLRFR_RAMERRFC | PKA_CLRFR_ADDRERRFC
                                            | PKA_CLRFR_OPERRFC);

  CCB_Memcpy_u32_to_u8(pSignature->pRSign, &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_OUT_SIGNATURE_R],
                       pCurveParam->primeOrderSizeByte);
  CCB_Memcpy_u32_to_u8(pSignature->pSSign, &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_SIGN_OUT_SIGNATURE_S],
                       pCurveParam->primeOrderSizeByte);

  if (PKA_RAM_Erase(hccb) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Blob Usage: ECC Compute Scalar Multiplication.
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pClearPrivateKey pointer to the related wrapped Private Key Blob.
  * @param  PublicKey is table of two coordinates X and Y of the publicKey.
  * @retval HAL status.
  */
static HAL_StatusTypeDef PKA_ECC_ComputeScalarMul(CCB_HandleTypeDef *hccb, CCB_ECCMulCurveParamTypeDef *pCurveParam,
                                                  const uint8_t *pClearPrivateKey, uint32_t PublicKey[2][20])
{
  uint32_t tickstart;
  uint32_t timeout = HAL_CCB_TIMEOUT_DEFAULT_VALUE;

  /********************************************************************************** Set input parameter in PKA RAM */
  /* Get the prime order n length */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_IN_EXP_NB_BITS]\
    = GetOptBitSize_u8(pCurveParam->primeOrderSizeByte, *(pCurveParam->pPrimeOrder));

  /* Get the modulus length */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_IN_OP_NB_BITS]\
    = GetOptBitSize_u8(pCurveParam->modulusSizeByte, *(pCurveParam->pModulus));

  /* Get the coefficient a sign */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_IN_A_COEFF_SIGN] = pCurveParam->coefSignA;

  /* Move the input parameters coefficient |a| to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_IN_A_COEFF], pCurveParam->pAbsCoefA,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECC_SCALAR_MUL_IN_A_COEFF + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters coefficient b to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_IN_B_COEFF], pCurveParam->pCoefB,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECC_SCALAR_MUL_IN_B_COEFF + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters modulus value p to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_IN_MOD_GF], pCurveParam->pModulus,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECC_SCALAR_MUL_IN_MOD_GF + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters scalar multiplier k to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_IN_K], pClearPrivateKey,
                       pCurveParam->primeOrderSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECC_SCALAR_MUL_IN_K + ((pCurveParam->primeOrderSizeByte + 3UL) / 4UL));

  /* Move the input parameters Point P coordinate x to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X],
                       pCurveParam->pPointX, pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters Point P coordinate y to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y],
                       pCurveParam->pPointY, pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters curve prime order N to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_IN_N_PRIME_ORDER],
                       pCurveParam->pPrimeOrder,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECC_SCALAR_MUL_IN_N_PRIME_ORDER + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /******************************************************************************************** Start the operation */
  /* Init tickstart for timeout management*/
  tickstart = HAL_GetTick();

  /* Set the mode and deactivate the interrupts */
  MODIFY_REG(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR,
             PKA_CR_MODE | PKA_CR_PROCENDIE | PKA_CR_RAMERRIE | PKA_CR_ADDRERRIE | PKA_CR_OPERRIE,
             CCB_PKA_ECC_MUL_MODE << PKA_CR_MODE_Pos);

  /* Start the computation */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->CR |= PKA_CR_START;

  /* Wait for the end of operation or timeout */
  while ((HAL_CCB_GET_PKA_INSTANCE(hccb)->SR & PKA_SR_PROCENDF) == 0UL)
  {
    if (((HAL_GetTick() - tickstart) > timeout) || (timeout == 0UL))
    {
      /* Abort any ongoing operation */
      CLEAR_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_EN);
      /* Make ready for the next operation */
      SET_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_EN);

