zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
      return HAL_TIMEOUT;
    }
  }

  /* Clear all flags */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->CLRFR |= (PKA_CLRFR_PROCENDFC | PKA_CLRFR_RAMERRFC | PKA_CLRFR_ADDRERRFC
                                            | PKA_CLRFR_OPERRFC);
  /* get PublicKey result */
  /* Move the result from appropriate location (with opprand size in 32bit word ) */
  CCB_Memcpy_u32_to_u32(PublicKey[0], &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_X],
                        ((pCurveParam->modulusSizeByte + 3UL) / 4UL));
  CCB_Memcpy_u32_to_u32(PublicKey[1], &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_Y],
                        ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  if (PKA_RAM_Erase(hccb) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Compute CCB Modular exponentiation.
  * @param  hccb CCB handle.
  * @param  pParam pointer to the modular exponatiation parameters.
  * @param  pRSAClearPrivateKey pointer to the clear Private Key.
  * @param  pOp1 Pointer to Operand 1 (Array of size elements).
  * @param  pReferenceModularExp pointer to the ReferenceModularExp computed in modular exponentiation Blob creation.
  * @retval HAL status.
  */
static HAL_StatusTypeDef PKA_RSA_ComputeModularExp(CCB_HandleTypeDef *hccb, CCB_RSAParamTypeDef *pParam,
                                                   const CCB_RSAClearKeyTypeDef *pRSAClearPrivateKey,
                                                   uint8_t *pOp1, uint32_t *pReferenceModularExp)
{
  uint32_t tickstart = HAL_GetTick();

  /* Get the number of bit per operand */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_IN_OP_NB_BITS] = pParam->modulusSizeByte * 8U;

  /* Get the number of bit of the exponent */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_IN_EXP_NB_BITS] = pParam->expSizeByte * 8U;

  /* Move the input parameters pOp1 to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_PROTECT_IN_EXPONENT_BASE], pOp1,
                       pParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_MODULAR_EXP_PROTECT_IN_EXPONENT_BASE + ((pParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the exponent to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_PROTECT_IN_EXPONENT],
                       pRSAClearPrivateKey->pExp, pParam->expSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_MODULAR_EXP_PROTECT_IN_EXPONENT + ((pParam->expSizeByte + 3UL) / 4UL));

  /* Move the modulus to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_PROTECT_IN_MODULUS], pParam->pMod,
                       pParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_MODULAR_EXP_PROTECT_IN_MODULUS + ((pParam->modulusSizeByte + 3UL) / 4UL));

  /* Move Phi value to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_PROTECT_IN_PHI],
                       pRSAClearPrivateKey->pPhi, pParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_MODULAR_EXP_PROTECT_IN_PHI + ((pParam->modulusSizeByte + 3UL) / 4UL));

  /* Set the mode and deactivate the interrupts */
  MODIFY_REG(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR,
             PKA_CR_MODE | PKA_CR_PROCENDIE | PKA_CR_RAMERRIE | PKA_CR_ADDRERRIE | PKA_CR_OPERRIE,
             CCB_PKA_MODE_MODULAR_EXP_PROTECT << PKA_CR_MODE_Pos);

  /* Start the computation */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->CR |= PKA_CR_START;

  /* Wait for the end of operation or timeout */
  while ((HAL_CCB_GET_PKA_INSTANCE(hccb)->SR & PKA_SR_PROCENDF) == 0UL)
  {
    /* Check if timeout is disabled (set to infinite wait) */
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Abort any ongoing operation */
      CLEAR_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_EN);
      /* Make ready for the next operation */
      SET_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_EN);
      return HAL_TIMEOUT;
    }
  }

  /* Clear all flags */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->CLRFR |= (PKA_CLRFR_PROCENDFC | PKA_CLRFR_RAMERRFC | PKA_CLRFR_ADDRERRFC
                                            | PKA_CLRFR_OPERRFC);

  /* Move the result from appropriate location (with opprand size in 32bit word ) */
  CCB_Memcpy_u32_to_u32(pReferenceModularExp, &HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_MODULAR_EXP_OUT_RESULT],
                        ((pParam->modulusSizeByte + 3UL) / 4UL));

  if (PKA_RAM_Erase(hccb) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  return HAL_OK;
}

#endif /* GENERATOR_SW_SANITY_CHECK_AVAILABLE_ALL_DEVICES */
/**
 @brief  Verify the validity of a signature using elliptic curves over prime fields in blocking mode.
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pPublicKeyOut pointer to the public key.
  * @param  pHash pointer to the hash.
  * @param  pSignature Pointer to input signature
  * @retval HAL status.
  */
static HAL_StatusTypeDef PKA_ECDSAVerif(CCB_HandleTypeDef *hccb, CCB_ECDSACurveParamTypeDef *pCurveParam,
                                        CCB_ECCMulPointTypeDef *pPublicKeyOut, const uint8_t *pHash,
                                        CCB_ECDSASignTypeDef *pSignature)
{
  uint32_t tickstart;
  uint32_t timeout = HAL_CCB_TIMEOUT_DEFAULT_VALUE;

  /* Set CCB input parameter in PKA RAM */
  /* Get the prime order n length */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_VERIF_IN_ORDER_NB_BITS] \
    = GetOptBitSize_u8(pCurveParam->primeOrderSizeByte, *(pCurveParam->pPrimeOrder));

  /* Get the modulus p length */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_VERIF_IN_MOD_NB_BITS] \
    = GetOptBitSize_u8(pCurveParam->modulusSizeByte, *(pCurveParam->pModulus));

  /* Get the coefficient a sign */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_VERIF_IN_A_COEFF_SIGN] = pCurveParam->coefSignA;

  /* Move the input parameters coefficient |a| to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_VERIF_IN_A_COEFF], pCurveParam->pAbsCoefA,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_VERIF_IN_A_COEFF + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters modulus value p to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_VERIF_IN_MOD_GF], pCurveParam->pModulus,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_VERIF_IN_MOD_GF + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters base point G coordinate x to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_VERIF_IN_INITIAL_POINT_X],
                       pCurveParam->pPointX, pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_VERIF_IN_INITIAL_POINT_X + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters base point G coordinate y to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_VERIF_IN_INITIAL_POINT_Y],
                       pCurveParam->pPointY, pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_VERIF_IN_INITIAL_POINT_Y + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters public-key curve point Q coordinate xQ to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_X],
                       pPublicKeyOut->pPointX,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_X + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters public-key curve point Q coordinate xQ to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_Y],
                       pPublicKeyOut->pPointY,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_Y + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters signature part r to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_VERIF_IN_SIGNATURE_R], pSignature->pRSign,
                       pCurveParam->primeOrderSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_VERIF_IN_SIGNATURE_R + ((pCurveParam->primeOrderSizeByte + 3UL) / 4UL));

  /* Move the input parameters signature part s to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_VERIF_IN_SIGNATURE_S], pSignature->pSSign,
                       pCurveParam->primeOrderSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_VERIF_IN_SIGNATURE_S + ((pCurveParam->primeOrderSizeByte + 3UL) / 4UL));

  /* Move the input parameters hash of message z to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_VERIF_IN_HASH_E], pHash,
                       pCurveParam->primeOrderSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_VERIF_IN_HASH_E + ((pCurveParam->primeOrderSizeByte + 3UL) / 4UL));

  /* Move the input parameters curve prime order n to PKA RAM */
  CCB_Memcpy_u8_to_u32(&HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_VERIF_IN_ORDER_N], pCurveParam->pPrimeOrder,
                       pCurveParam->primeOrderSizeByte);
  RAM_PARAM_END(HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM,
                PKA_ECDSA_VERIF_IN_ORDER_N + ((pCurveParam->primeOrderSizeByte + 3UL) / 4UL));


