zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_ccb.c
  /* Set the mode and deactivate the interrupts */
  MODIFY_REG(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR,
             PKA_CR_MODE | PKA_CR_PROCENDIE | PKA_CR_RAMERRIE | PKA_CR_ADDRERRIE | PKA_CR_OPERRIE,
             CCB_PKA_MODE_ECDSA_VERIFICATION << PKA_CR_MODE_Pos);

  /* Start the computation */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->CR |= PKA_CR_START;

  tickstart = HAL_GetTick();
  /* Wait for the end of operation or timeout */
  while ((HAL_CCB_GET_PKA_INSTANCE(hccb)->SR & PKA_SR_PROCENDF) == 0UL)
  {
    if (((HAL_GetTick() - tickstart) > timeout) || (timeout == 0UL))
    {
      /* Abort any ongoing operation */
      CLEAR_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_EN);
      /* Make ready for the next operation */
      SET_BIT(HAL_CCB_GET_PKA_INSTANCE(hccb)->CR, PKA_CR_EN);
      return HAL_TIMEOUT;
    }
  }

  /* Clear all flags */
  HAL_CCB_GET_PKA_INSTANCE(hccb)->CLRFR |= (PKA_CLRFR_PROCENDFC | PKA_CLRFR_RAMERRFC | PKA_CLRFR_ADDRERRFC
                                            | PKA_CLRFR_OPERRFC);

  return HAL_OK;
}

/**
  * @brief  Return the result of the ECDSA verification operation.
  * @param  hccb CCB handle.
  * @retval 1 if signature is verified, 0 in other case
  */
static uint32_t PKA_ECDSAVerif_Result(CCB_HandleTypeDef *hccb)
{
  return (HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[PKA_ECDSA_VERIF_OUT_RESULT]);
}

/**
  * @brief  Reset the PKA RAM.
  * @param  hccb CCB handle.
  * @retval None
  */
static void CCB_PKA_RAMReset(CCB_HandleTypeDef *hccb)
{
  uint32_t index;

  /* For each element in the PKA RAM */
  for (index = 0; index < CCB_PKA_RAM_SIZE; index++)
  {
    /* Clear the content */
    HAL_CCB_GET_PKA_INSTANCE(hccb)->RAM[index] = 0UL;
  }
}

#if (defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX))
/**
  * @brief  RNG sequence to resilient recover from a seed error
  * @retval HAL status
  */
HAL_StatusTypeDef CCB_RNG_ResilientRecoverSeedError(CCB_HandleTypeDef *hccb)
{
  uint32_t timeout;
  uint32_t htsr_temp = 0U;
  uint32_t htsr_previous_temp = 0U;
  uint32_t htsr_count = 0U;
  uint32_t nsmr_temp = 0U;
  uint32_t tickstart1 = 0U;
  uint32_t tickstart2 = 0U;
  uint32_t tickstart3 = 0U;
  uint32_t oscillators_count = 0U;
  uint32_t config_b_fewer_than_6_osc_count = 0U;
  uint8_t count = 0U;

  /* timeout here is an emperic value */
  timeout = (1UL + ((1UL << (READ_BIT(HAL_CCB_GET_RNG_INSTANCE(hccb)->CR, RNG_CR_CLKDIV) >> 16UL))
                    * CCB_RNG_TIMEOUT_VALUE / 8UL));
  LL_RNG_Enable(HAL_CCB_GET_RNG_INSTANCE(hccb));

  tickstart1 = HAL_GetTick();

  /* Check if seed error current status indicates no error and auto-reset succeeded */
  if (LL_RNG_IsActiveFlag_SECS(HAL_CCB_GET_RNG_INSTANCE(hccb)) == 0U)
  {
    /* Clear SEIS flag when automatic reset is activated */
    LL_RNG_ClearFlag_SEIS(HAL_CCB_GET_RNG_INSTANCE(hccb));
  }

  else  /* Sequence to fully recover from a seed error*/
  {
    if (LL_RNG_IsConfigLocked(HAL_CCB_GET_RNG_INSTANCE(hccb)) == 0U)
    {
      do
      {
        if (LL_RNG_IsActiveFlag_SECS(HAL_CCB_GET_RNG_INSTANCE(hccb)) == 0U)
        {
          break;
        }
        /* Read oscillator status registers combined */
        htsr_temp = LL_RNG_GetHealthTestStatus(HAL_CCB_GET_RNG_INSTANCE(hccb), 0U);
        htsr_temp |= LL_RNG_GetHealthTestStatus(HAL_CCB_GET_RNG_INSTANCE(hccb), 1U);
        if (htsr_temp > 0U)
        {
          /* If any oscillator status bits overlap with previous status, increment counter */
          if ((htsr_temp & htsr_previous_temp) != 0U)
          {
            htsr_count++;
          }

          if (htsr_count > 3U)
          {
            /* if the same repetitive or adaptative error is detected 3 times */
            nsmr_temp = LL_RNG_GetNoiseSourceMask(HAL_CCB_GET_RNG_INSTANCE(hccb));

            /* deactivate the same osc in each triple oscillator (Mask oscillators with the seed error by
            clearing bits shifted right by 1) */
            nsmr_temp = nsmr_temp & ~(htsr_temp >> 1U);

            /* Count the number of active oscillators in nsmr */
            oscillators_count = 0U;
            for (count = 0U; count < 9U; count++)
            {
              if (((nsmr_temp >> count) & 0x1U) != 0U)
              {
                /* increment count1 for each 1 in nsmr */
                oscillators_count++;
              }
            }

            if (oscillators_count < 6U)
            {
              /* If fewer than 6 oscillators remain active, unmask all oscillators --> Reset masking */
              nsmr_temp = LL_RNG_GetOscNoiseSrc(HAL_CCB_GET_RNG_INSTANCE(hccb),
                                                LL_RNG_NOISE_SRC_1 | LL_RNG_NOISE_SRC_2 | LL_RNG_NOISE_SRC_3);
              htsr_previous_temp = 0;
              htsr_count = 0U;
              if ((HAL_CCB_GET_RNG_INSTANCE(hccb)->CR  & RNG_CR_CLKDIV_Msk) <
                  ((uint32_t)RNG_CAND_NIST_CR_VALUE & RNG_CR_CLKDIV_Msk))
              {
                config_b_fewer_than_6_osc_count++;
              }
            }

            if (config_b_fewer_than_6_osc_count > 2U)
            {
              /* Reset RNG condition */
              WRITE_REG(HAL_CCB_GET_RNG_INSTANCE(hccb)->CR, (RNG_CR_CONDRST_Msk | (uint32_t)RNG_CAND_NIST_CR_VALUE));

              /* Update mask register with new oscillator mask */
              LL_RNG_SetNoiseSourceMask(HAL_CCB_GET_RNG_INSTANCE(hccb), nsmr_temp);

              /* Clear condition reset bit to resume operation */
              LL_RNG_DisableCondReset(HAL_CCB_GET_RNG_INSTANCE(hccb));
            }

            else
            {
              /* Reset RNG condition */
              WRITE_REG(HAL_CCB_GET_RNG_INSTANCE(hccb)->CR,
                        (HAL_CCB_GET_RNG_INSTANCE(hccb)->CR & ~RNG_CR_RNGEN_Msk) | RNG_CR_CONDRST_Msk);

              /* Update mask register with new oscillator mask */
              LL_RNG_SetNoiseSourceMask(HAL_CCB_GET_RNG_INSTANCE(hccb), nsmr_temp);

              /* Clear condition reset bit to resume operation */
              LL_RNG_DisableCondReset(HAL_CCB_GET_RNG_INSTANCE(hccb));
            }
          }

          else
          {
            /* Briefly toggle conditional reset to recover RNG */
            WRITE_REG(HAL_CCB_GET_RNG_INSTANCE(hccb)->CR,
                      (HAL_CCB_GET_RNG_INSTANCE(hccb)->CR & ~RNG_CR_RNGEN_Msk) | RNG_CR_CONDRST_Msk);

            /* unmask all oscillators to find another working condition */
            LL_RNG_SetNoiseSourceMask(HAL_CCB_GET_RNG_INSTANCE(hccb),
                                      LL_RNG_GetOscNoiseSrc(RNG, LL_RNG_OSC_1 | LL_RNG_OSC_2 | LL_RNG_OSC_3));
            LL_RNG_DisableCondReset(HAL_CCB_GET_RNG_INSTANCE(hccb));
          }

          /* Wait until RNG is not busy */
          tickstart2 = HAL_GetTick();
          do
          {
            if ((HAL_GetTick() - tickstart2) > CCB_RNG_TIMEOUT_VALUE)
            {
              /* New check to avoid false timeout detection in case of preemption */
              LL_RNG_Disable(HAL_CCB_GET_RNG_INSTANCE(hccb));
              return HAL_ERROR;
            }
          } while (HAL_IS_BIT_SET(HAL_CCB_GET_RNG_INSTANCE(hccb)->SR, RNG_SR_BUSY));

          /* No timeout --> Enable RNG */
          LL_RNG_Enable(HAL_CCB_GET_RNG_INSTANCE(hccb));
          tickstart3 = HAL_GetTick();
          do
          {
            if (LL_RNG_IsActiveFlag_DRDY(HAL_CCB_GET_RNG_INSTANCE(hccb)) != 0UL)
            {
              break;
            }
            if ((HAL_GetTick() - tickstart3) > timeout)
            {
              /* New check to avoid false timeout detection in case of preemption */
              if (LL_RNG_IsActiveFlag_DRDY(HAL_CCB_GET_RNG_INSTANCE(hccb)) == 0UL)
              {
                if (LL_RNG_IsActiveFlag_SECS(HAL_CCB_GET_RNG_INSTANCE(hccb)) == 0UL)
                {
                  LL_RNG_Disable(HAL_CCB_GET_RNG_INSTANCE(hccb));
                  return HAL_ERROR;
                }
              }
            }
          } while (LL_RNG_IsActiveFlag_SECS(HAL_CCB_GET_RNG_INSTANCE(hccb)) == 0UL);

          /* Accumulate seed error status bits */
          htsr_previous_temp = htsr_previous_temp | htsr_temp;
        }
      } while ((HAL_GetTick() - tickstart1) <= timeout);
    }
  }

  /*Check if seed error current status (SECS)is set */
  if (LL_RNG_IsActiveFlag_SECS(HAL_CCB_GET_RNG_INSTANCE(hccb)) != 0U)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(CCB) && defined(HAL_CCB_MODULE_ENABLED) */
/**
  * @}
  */
